import {Code} from "./Interface";

const cityCode = [{ "city": "北京", "code": "101010100" }, { "city": "海淀", "code": "101010200" }, {
    "city": "朝阳",
    "code": "101010300"
}, { "city": "顺义", "code": "101010400" }, { "city": "怀柔", "code": "101010500" }, {
    "city": "通州",
    "code": "101010600"
}, { "city": "昌平", "code": "101010700" }, { "city": "延庆", "code": "101010800" }, {
    "city": "丰台",
    "code": "101010900"
}, { "city": "石景山", "code": "101011000" }, { "city": "大兴", "code": "101011100" }, {
    "city": "房山",
    "code": "101011200"
}, { "city": "密云", "code": "101011300" }, { "city": "门头沟", "code": "101011400" }, {
    "city": "平谷",
    "code": "101011500"
}, { "city": "上海", "code": "101020100" }, { "city": "闵行", "code": "101020200" }, {
    "city": "宝山",
    "code": "101020300"
}, { "city": "嘉定", "code": "101020500" }, { "city": "浦东新区", "code": "101020600" }, {
    "city": "金山",
    "code": "101020700"
}, { "city": "青浦", "code": "101020800" }, { "city": "松江", "code": "101020900" }, {
    "city": "奉贤",
    "code": "101021000"
}, { "city": "崇明", "code": "101021100" }, { "city": "徐汇", "code": "101021200" }, {
    "city": "天津",
    "code": "101030100"
}, { "city": "武清", "code": "101030200" }, { "city": "宝坻", "code": "101030300" }, {
    "city": "东丽",
    "code": "101030400"
}, { "city": "西青", "code": "101030500" }, { "city": "北辰", "code": "101030600" }, {
    "city": "宁河",
    "code": "101030700"
}, { "city": "静海", "code": "101030900" }, { "city": "津南", "code": "101031000" }, {
    "city": "滨海新区",
    "code": "101031100"
}, { "city": "蓟县", "code": "101031400" }, { "city": "重庆", "code": "101040100" }, {
    "city": "永川",
    "code": "101040200"
}, { "city": "合川", "code": "101040300" }, { "city": "南川", "code": "101040400" }, {
    "city": "江津",
    "code": "101040500"
}, { "city": "万盛", "code": "101040600" }, { "city": "渝北", "code": "101040700" }, {
    "city": "北碚",
    "code": "101040800"
}, { "city": "巴南", "code": "101040900" }, { "city": "长寿", "code": "101041000" }, {
    "city": "黔江",
    "code": "101041100"
}, { "city": "万州", "code": "101041300" }, { "city": "涪陵", "code": "101041400" }, {
    "city": "开县",
    "code": "101041500"
}, { "city": "城口", "code": "101041600" }, { "city": "云阳", "code": "101041700" }, {
    "city": "巫溪",
    "code": "101041800"
}, { "city": "奉节", "code": "101041900" }, { "city": "巫山", "code": "101042000" }, {
    "city": "潼南",
    "code": "101042100"
}, { "city": "垫江", "code": "101042200" }, { "city": "梁平", "code": "101042300" }, {
    "city": "忠县",
    "code": "101042400"
}, { "city": "石柱", "code": "101042500" }, { "city": "大足", "code": "101042600" }, {
    "city": "荣昌",
    "code": "101042700"
}, { "city": "铜梁", "code": "101042800" }, { "city": "璧山", "code": "101042900" }, {
    "city": "丰都",
    "code": "101043000"
}, { "city": "武隆", "code": "101043100" }, { "city": "彭水", "code": "101043200" }, {
    "city": "綦江",
    "code": "101043300"
}, { "city": "酉阳", "code": "101043400" }, { "city": "秀山", "code": "101043600" }, {
    "city": "哈尔滨",
    "code": "101050101"
}, { "city": "双城", "code": "101050102" }, { "city": "呼兰", "code": "101050103" }, {
    "city": "阿城",
    "code": "101050104"
}, { "city": "宾县", "code": "101050105" }, { "city": "依兰", "code": "101050106" }, {
    "city": "巴彦",
    "code": "101050107"
}, { "city": "通河", "code": "101050108" }, { "city": "方正", "code": "101050109" }, {
    "city": "延寿",
    "code": "101050110"
}, { "city": "尚志", "code": "101050111" }, { "city": "五常", "code": "101050112" }, {
    "city": "木兰",
    "code": "101050113"
}, { "city": "道里", "code": "101050114" }, { "city": "南岗", "code": "101050115" }, {
    "city": "道外",
    "code": "101050116"
}, { "city": "平房", "code": "101050117" }, { "city": "松北", "code": "101050118" }, {
    "city": "香坊",
    "code": "101050119"
}, { "city": "齐齐哈尔", "code": "101050201" }, { "city": "讷河", "code": "101050202" }, {
    "city": "龙江",
    "code": "101050203"
}, { "city": "甘南", "code": "101050204" }, { "city": "富裕", "code": "101050205" }, {
    "city": "依安",
    "code": "101050206"
}, { "city": "拜泉", "code": "101050207" }, { "city": "克山", "code": "101050208" }, {
    "city": "克东",
    "code": "101050209"
}, { "city": "泰来", "code": "101050210" }, { "city": "龙沙", "code": "101050211" }, {
    "city": "建华",
    "code": "101050212"
}, { "city": "铁锋", "code": "101050213" }, { "city": "昂昂溪", "code": "101050214" }, {
    "city": "富拉尔基",
    "code": "101050215"
}, { "city": "碾子山", "code": "101050216" }, { "city": "梅里斯", "code": "101050217" }, {
    "city": "牡丹江",
    "code": "101050301"
}, { "city": "海林", "code": "101050302" }, { "city": "穆棱", "code": "101050303" }, {
    "city": "林口",
    "code": "101050304"
}, { "city": "绥芬河", "code": "101050305" }, { "city": "宁安", "code": "101050306" }, {
    "city": "东宁",
    "code": "101050307"
}, { "city": "东安", "code": "101050308" }, { "city": "阳明", "code": "101050309" }, {
    "city": "爱民",
    "code": "101050310"
}, { "city": "西安", "code": "101050311" }, { "city": "佳木斯", "code": "101050401" }, {
    "city": "汤原",
    "code": "101050402"
}, { "city": "抚远", "code": "101050403" }, { "city": "桦川", "code": "101050404" }, {
    "city": "桦南",
    "code": "101050405"
}, { "city": "同江", "code": "101050406" }, { "city": "富锦", "code": "101050407" }, {
    "city": "向阳",
    "code": "101050408"
}, { "city": "前进", "code": "101050409" }, { "city": "东风", "code": "101050410" }, {
    "city": "郊区",
    "code": "101050411"
}, { "city": "绥化", "code": "101050501" }, { "city": "肇东", "code": "101050502" }, {
    "city": "安达",
    "code": "101050503"
}, { "city": "海伦", "code": "101050504" }, { "city": "明水", "code": "101050505" }, {
    "city": "望奎",
    "code": "101050506"
}, { "city": "兰西", "code": "101050507" }, { "city": "青冈", "code": "101050508" }, {
    "city": "庆安",
    "code": "101050509"
}, { "city": "绥棱", "code": "101050510" }, { "city": "北林", "code": "101050511" }, {
    "city": "黑河",
    "code": "101050601"
}, { "city": "嫩江", "code": "101050602" }, { "city": "孙吴", "code": "101050603" }, {
    "city": "逊克",
    "code": "101050604"
}, { "city": "五大连池", "code": "101050605" }, { "city": "北安", "code": "101050606" }, {
    "city": "爱辉",
    "code": "101050607"
}, { "city": "大兴安岭", "code": "101050701" }, { "city": "塔河", "code": "101050702" }, {
    "city": "漠河",
    "code": "101050703"
}, { "city": "呼玛", "code": "101050704" }, { "city": "呼中", "code": "101050705" }, {
    "city": "新林",
    "code": "101050706"
}, { "city": "加格达奇", "code": "101050708" }, { "city": "伊春", "code": "101050801" }, {
    "city": "乌伊岭",
    "code": "101050802"
}, { "city": "五营", "code": "101050803" }, { "city": "铁力", "code": "101050804" }, {
    "city": "嘉荫",
    "code": "101050805"
}, { "city": "南岔", "code": "101050806" }, { "city": "友好", "code": "101050807" }, {
    "city": "西林",
    "code": "101050808"
}, { "city": "翠峦", "code": "101050809" }, { "city": "新青", "code": "101050810" }, {
    "city": "美溪",
    "code": "101050811"
}, { "city": "金山屯", "code": "101050812" }, { "city": "乌马河", "code": "101050813" }, {
    "city": "汤旺河",
    "code": "101050814"
}, { "city": "带岭", "code": "101050815" }, { "city": "红星", "code": "101050816" }, {
    "city": "上甘岭",
    "code": "101050817"
}, { "city": "大庆", "code": "101050901" }, { "city": "林甸", "code": "101050902" }, {
    "city": "肇州",
    "code": "101050903"
}, { "city": "肇源", "code": "101050904" }, { "city": "杜尔伯特", "code": "101050905" }, {
    "city": "萨尔图",
    "code": "101050906"
}, { "city": "龙凤", "code": "101050907" }, { "city": "让胡路", "code": "101050908" }, {
    "city": "红岗",
    "code": "101050909"
}, { "city": "大同", "code": "101050910" }, { "city": "新兴", "code": "101051001" }, {
    "city": "七台河",
    "code": "101051002"
}, { "city": "勃利", "code": "101051003" }, { "city": "桃山", "code": "101051004" }, {
    "city": "茄子河",
    "code": "101051005"
}, { "city": "鸡西", "code": "101051101" }, { "city": "虎林", "code": "101051102" }, {
    "city": "密山",
    "code": "101051103"
}, { "city": "鸡东", "code": "101051104" }, { "city": "鸡冠", "code": "101051105" }, {
    "city": "恒山",
    "code": "101051106"
}, { "city": "滴道", "code": "101051107" }, { "city": "梨树", "code": "101051108" }, {
    "city": "城子河",
    "code": "101051109"
}, { "city": "麻山", "code": "101051110" }, { "city": "鹤岗", "code": "101051201" }, {
    "city": "绥滨",
    "code": "101051202"
}, { "city": "萝北", "code": "101051203" }, { "city": "向阳", "code": "101051204" }, {
    "city": "工农",
    "code": "101051205"
}, { "city": "南山", "code": "101051206" }, { "city": "兴安", "code": "101051207" }, {
    "city": "东山",
    "code": "101051208"
}, { "city": "兴山", "code": "101051209" }, { "city": "双鸭山", "code": "101051301" }, {
    "city": "集贤",
    "code": "101051302"
}, { "city": "宝清", "code": "101051303" }, { "city": "饶河", "code": "101051304" }, {
    "city": "友谊",
    "code": "101051305"
}, { "city": "尖山", "code": "101051306" }, { "city": "岭东", "code": "101051307" }, {
    "city": "四方台",
    "code": "101051308"
}, { "city": "宝山", "code": "101051309" }, { "city": "长春", "code": "101060101" }, {
    "city": "农安",
    "code": "101060102"
}, { "city": "德惠", "code": "101060103" }, { "city": "九台", "code": "101060104" }, {
    "city": "榆树",
    "code": "101060105"
}, { "city": "双阳", "code": "101060106" }, { "city": "二道", "code": "101060107" }, {
    "city": "南关",
    "code": "101060108"
}, { "city": "宽城", "code": "101060109" }, { "city": "朝阳", "code": "101060110" }, {
    "city": "绿园",
    "code": "101060111"
}, { "city": "吉林", "code": "101060201" }, { "city": "舒兰", "code": "101060202" }, {
    "city": "永吉",
    "code": "101060203"
}, { "city": "蛟河", "code": "101060204" }, { "city": "磐石", "code": "101060205" }, {
    "city": "桦甸",
    "code": "101060206"
}, { "city": "昌邑", "code": "101060207" }, { "city": "龙潭", "code": "101060208" }, {
    "city": "船营",
    "code": "101060209"
}, { "city": "丰满", "code": "101060210" }, { "city": "延吉", "code": "101060301" }, {
    "city": "敦化",
    "code": "101060302"
}, { "city": "安图", "code": "101060303" }, { "city": "汪清", "code": "101060304" }, {
    "city": "和龙",
    "code": "101060305"
}, { "city": "延边", "code": "101060306" }, { "city": "龙井", "code": "101060307" }, {
    "city": "珲春",
    "code": "101060308"
}, { "city": "图们", "code": "101060309" }, { "city": "四平", "code": "101060401" }, {
    "city": "双辽",
    "code": "101060402"
}, { "city": "梨树", "code": "101060403" }, { "city": "公主岭", "code": "101060404" }, {
    "city": "伊通",
    "code": "101060405"
}, { "city": "铁西", "code": "101060406" }, { "city": "铁东", "code": "101060407" }, {
    "city": "通化",
    "code": "101060501"
}, { "city": "梅河口", "code": "101060502" }, { "city": "柳河", "code": "101060503" }, {
    "city": "辉南",
    "code": "101060504"
}, { "city": "集安", "code": "101060505" }, { "city": "通化县", "code": "101060506" }, {
    "city": "东昌",
    "code": "101060507"
}, { "city": "二道江", "code": "101060508" }, { "city": "白城", "code": "101060601" }, {
    "city": "洮南",
    "code": "101060602"
}, { "city": "大安", "code": "101060603" }, { "city": "镇赉", "code": "101060604" }, {
    "city": "通榆",
    "code": "101060605"
}, { "city": "洮北", "code": "101060606" }, { "city": "辽源", "code": "101060701" }, {
    "city": "东丰",
    "code": "101060702"
}, { "city": "东辽", "code": "101060703" }, { "city": "龙山", "code": "101060704" }, {
    "city": "西安",
    "code": "101060705"
}, { "city": "松原", "code": "101060801" }, { "city": "乾安", "code": "101060802" }, {
    "city": "前郭",
    "code": "101060803"
}, { "city": "长岭", "code": "101060804" }, { "city": "扶余", "code": "101060805" }, {
    "city": "宁江",
    "code": "101060806"
}, { "city": "白山", "code": "101060901" }, { "city": "靖宇", "code": "101060902" }, {
    "city": "临江",
    "code": "101060903"
}, { "city": "东岗", "code": "101060904" }, { "city": "长白", "code": "101060905" }, {
    "city": "抚松",
    "code": "101060906"
}, { "city": "江源", "code": "101060907" }, { "city": "浑江", "code": "101060908" }, {
    "city": "沈阳",
    "code": "101070101"
}, { "city": "浑南", "code": "101070102" }, { "city": "辽中", "code": "101070103" }, {
    "city": "康平",
    "code": "101070104"
}, { "city": "法库", "code": "101070105" }, { "city": "新民", "code": "101070106" }, {
    "city": "和平",
    "code": "101070107"
}, { "city": "沈河", "code": "101070108" }, { "city": "大东", "code": "101070109" }, {
    "city": "皇姑",
    "code": "101070110"
}, { "city": "铁西", "code": "101070111" }, { "city": "苏家屯", "code": "101070112" }, {
    "city": "沈北新区",
    "code": "101070113"
}, { "city": "于洪", "code": "101070114" }, { "city": "大连", "code": "101070201" }, {
    "city": "瓦房店",
    "code": "101070202"
}, { "city": "金州", "code": "101070203" }, { "city": "普兰店", "code": "101070204" }, {
    "city": "旅顺",
    "code": "101070205"
}, { "city": "长海", "code": "101070206" }, { "city": "庄河", "code": "101070207" }, {
    "city": "中山",
    "code": "101070208"
}, { "city": "西岗", "code": "101070209" }, { "city": "沙河口", "code": "101070210" }, {
    "city": "甘井子",
    "code": "101070211"
}, { "city": "鞍山", "code": "101070301" }, { "city": "台安", "code": "101070302" }, {
    "city": "岫岩",
    "code": "101070303"
}, { "city": "海城", "code": "101070304" }, { "city": "铁东", "code": "101070305" }, {
    "city": "铁西",
    "code": "101070306"
}, { "city": "立山", "code": "101070307" }, { "city": "千山", "code": "101070308" }, {
    "city": "抚顺",
    "code": "101070401"
}, { "city": "新宾", "code": "101070402" }, { "city": "清原", "code": "101070403" }, {
    "city": "新抚",
    "code": "101070405"
}, { "city": "东洲", "code": "101070406" }, { "city": "望花", "code": "101070407" }, {
    "city": "顺城",
    "code": "101070408"
}, { "city": "本溪", "code": "101070501" }, { "city": "本溪县", "code": "101070502" }, {
    "city": "平山",
    "code": "101070503"
}, { "city": "桓仁", "code": "101070504" }, { "city": "溪湖", "code": "101070505" }, {
    "city": "明山",
    "code": "101070506"
}, { "city": "南芬", "code": "101070507" }, { "city": "丹东", "code": "101070601" }, {
    "city": "凤城",
    "code": "101070602"
}, { "city": "宽甸", "code": "101070603" }, { "city": "东港", "code": "101070604" }, {
    "city": "元宝",
    "code": "101070605"
}, { "city": "振兴", "code": "101070606" }, { "city": "振安", "code": "101070607" }, {
    "city": "锦州",
    "code": "101070701"
}, { "city": "凌海", "code": "101070702" }, { "city": "古塔", "code": "101070703" }, {
    "city": "义县",
    "code": "101070704"
}, { "city": "黑山", "code": "101070705" }, { "city": "北镇", "code": "101070706" }, {
    "city": "凌河",
    "code": "101070707"
}, { "city": "太和", "code": "101070708" }, { "city": "营口", "code": "101070801" }, {
    "city": "大石桥",
    "code": "101070802"
}, { "city": "盖州", "code": "101070803" }, { "city": "站前", "code": "101070804" }, {
    "city": "西市",
    "code": "101070805"
}, { "city": "鲅鱼圈", "code": "101070806" }, { "city": "老边", "code": "101070807" }, {
    "city": "阜新",
    "code": "101070901"
}, { "city": "彰武", "code": "101070902" }, { "city": "海州", "code": "101070903" }, {
    "city": "新邱",
    "code": "101070904"
}, { "city": "太平", "code": "101070905" }, { "city": "清河门", "code": "101070906" }, {
    "city": "细河",
    "code": "101070907"
}, { "city": "辽阳", "code": "101071001" }, { "city": "辽阳县", "code": "101071002" }, {
    "city": "灯塔",
    "code": "101071003"
}, { "city": "弓长岭", "code": "101071004" }, { "city": "白塔", "code": "101071005" }, {
    "city": "文圣",
    "code": "101071006"
}, { "city": "宏伟", "code": "101071007" }, { "city": "太子河", "code": "101071008" }, {
    "city": "铁岭",
    "code": "101071101"
}, { "city": "开原", "code": "101071102" }, { "city": "昌图", "code": "101071103" }, {
    "city": "西丰",
    "code": "101071104"
}, { "city": "调兵山", "code": "101071105" }, { "city": "银州", "code": "101071106" }, {
    "city": "清河",
    "code": "101071107"
}, { "city": "朝阳", "code": "101071201" }, { "city": "双塔", "code": "101071202" }, {
    "city": "凌源",
    "code": "101071203"
}, { "city": "喀左", "code": "101071204" }, { "city": "北票", "code": "101071205" }, {
    "city": "龙城",
    "code": "101071206"
}, { "city": "建平县", "code": "101071207" }, { "city": "盘锦", "code": "101071301" }, {
    "city": "大洼",
    "code": "101071302"
}, { "city": "盘山", "code": "101071303" }, { "city": "双台子", "code": "101071304" }, {
    "city": "兴隆台",
    "code": "101071305"
}, { "city": "葫芦岛", "code": "101071401" }, { "city": "建昌", "code": "101071402" }, {
    "city": "绥中",
    "code": "101071403"
}, { "city": "兴城", "code": "101071404" }, { "city": "连山", "code": "101071405" }, {
    "city": "龙港",
    "code": "101071406"
}, { "city": "南票", "code": "101071407" }, { "city": "呼和浩特", "code": "101080101" }, {
    "city": "土左旗",
    "code": "101080102"
}, { "city": "托县", "code": "101080103" }, { "city": "和林", "code": "101080104" }, {
    "city": "清水河",
    "code": "101080105"
}, { "city": "赛罕", "code": "101080106" }, { "city": "武川", "code": "101080107" }, {
    "city": "新城",
    "code": "101080108"
}, { "city": "回民", "code": "101080109" }, { "city": "玉泉", "code": "101080110" }, {
    "city": "包头",
    "code": "101080201"
}, { "city": "白云鄂博", "code": "101080202" }, { "city": "满都拉", "code": "101080203" }, {
    "city": "土右旗",
    "code": "101080204"
}, { "city": "固阳", "code": "101080205" }, { "city": "达茂旗", "code": "101080206" }, {
    "city": "希拉穆仁",
    "code": "101080207"
}, { "city": "东河", "code": "101080208" }, { "city": "昆都仑", "code": "101080209" }, {
    "city": "青山",
    "code": "101080210"
}, { "city": "石拐", "code": "101080211" }, { "city": "九原", "code": "101080212" }, {
    "city": "乌海",
    "code": "101080301"
}, { "city": "海勃湾", "code": "101080302" }, { "city": "海南", "code": "101080303" }, {
    "city": "乌达",
    "code": "101080304"
}, { "city": "集宁", "code": "101080401" }, { "city": "卓资", "code": "101080402" }, {
    "city": "化德",
    "code": "101080403"
}, { "city": "商都", "code": "101080404" }, { "city": "乌兰察布", "code": "101080405" }, {
    "city": "兴和",
    "code": "101080406"
}, { "city": "凉城", "code": "101080407" }, { "city": "察右前旗", "code": "101080408" }, {
    "city": "察右中旗",
    "code": "101080409"
}, { "city": "察右后旗", "code": "101080410" }, { "city": "四子王旗", "code": "101080411" }, {
    "city": "丰镇",
    "code": "101080412"
}, { "city": "通辽", "code": "101080501" }, { "city": "舍伯吐", "code": "101080502" }, {
    "city": "科左中旗",
    "code": "101080503"
}, { "city": "科左后旗", "code": "101080504" }, { "city": "青龙山", "code": "101080505" }, {
    "city": "开鲁",
    "code": "101080506"
}, { "city": "库伦", "code": "101080507" }, { "city": "奈曼", "code": "101080508" }, {
    "city": "扎鲁特",
    "code": "101080509"
}, { "city": "科尔沁", "code": "101080510" }, { "city": "巴雅尔吐胡硕", "code": "101080511" }, {
    "city": "霍林郭勒",
    "code": "101080512"
}, { "city": "赤峰", "code": "101080601" }, { "city": "红山", "code": "101080602" }, {
    "city": "阿鲁旗",
    "code": "101080603"
}, { "city": "巴林左旗", "code": "101080605" }, { "city": "巴林右旗", "code": "101080606" }, {
    "city": "林西",
    "code": "101080607"
}, { "city": "克什克腾", "code": "101080608" }, { "city": "翁牛特", "code": "101080609" }, {
    "city": "岗子",
    "code": "101080610"
}, { "city": "喀喇沁", "code": "101080611" }, { "city": "八里罕", "code": "101080612" }, {
    "city": "宁城",
    "code": "101080613"
}, { "city": "敖汉", "code": "101080614" }, { "city": "元宝山", "code": "101080616" }, {
    "city": "松山",
    "code": "101080617"
}, { "city": "富河", "code": "101080618" }, { "city": "宝国图", "code": "101080619" }, {
    "city": "鄂尔多斯",
    "code": "101080701"
}, { "city": "达拉特", "code": "101080703" }, { "city": "准格尔", "code": "101080704" }, {
    "city": "鄂前旗",
    "code": "101080705"
}, { "city": "河南", "code": "101080706" }, { "city": "伊和乌素", "code": "101080707" }, {
    "city": "鄂托克",
    "code": "101080708"
}, { "city": "杭锦旗", "code": "101080709" }, { "city": "乌审旗", "code": "101080710" }, {
    "city": "伊金霍洛",
    "code": "101080711"
}, { "city": "乌审召", "code": "101080712" }, { "city": "东胜", "code": "101080713" }, {
    "city": "康巴什",
    "code": "101080714"
}, { "city": "临河", "code": "101080801" }, { "city": "五原", "code": "101080802" }, {
    "city": "磴口",
    "code": "101080803"
}, { "city": "乌前旗", "code": "101080804" }, { "city": "大佘太", "code": "101080805" }, {
    "city": "乌中旗",
    "code": "101080806"
}, { "city": "乌后旗", "code": "101080807" }, { "city": "海力素", "code": "101080808" }, {
    "city": "那仁宝力格",
    "code": "101080809"
}, { "city": "杭锦后旗", "code": "101080810" }, { "city": "巴彦淖尔", "code": "101080811" }, {
    "city": "锡林浩特",
    "code": "101080901"
}, { "city": "锡林郭勒", "code": "101080902" }, { "city": "二连浩特", "code": "101080903" }, {
    "city": "阿巴嘎",
    "code": "101080904"
}, { "city": "苏左旗", "code": "101080906" }, { "city": "苏右旗", "code": "101080907" }, {
    "city": "朱日和",
    "code": "101080908"
}, { "city": "东乌旗", "code": "101080909" }, { "city": "西乌旗", "code": "101080910" }, {
    "city": "太仆寺",
    "code": "101080911"
}, { "city": "镶黄旗", "code": "101080912" }, { "city": "正镶白旗", "code": "101080913" }, {
    "city": "正蓝旗",
    "code": "101080914"
}, { "city": "多伦", "code": "101080915" }, { "city": "博克图", "code": "101080916" }, {
    "city": "乌拉盖",
    "code": "101080917"
}, { "city": "海拉尔", "code": "101081001" }, { "city": "小二沟", "code": "101081002" }, {
    "city": "阿荣旗",
    "code": "101081003"
}, { "city": "莫力达瓦", "code": "101081004" }, { "city": "鄂伦春旗", "code": "101081005" }, {
    "city": "鄂温克旗",
    "code": "101081006"
}, { "city": "陈旗", "code": "101081007" }, { "city": "新左旗", "code": "101081008" }, {
    "city": "新右旗",
    "code": "101081009"
}, { "city": "满洲里", "code": "101081010" }, { "city": "牙克石", "code": "101081011" }, {
    "city": "扎兰屯",
    "code": "101081012"
}, { "city": "呼伦贝尔", "code": "101081013" }, { "city": "额尔古纳", "code": "101081014" }, {
    "city": "根河",
    "code": "101081015"
}, { "city": "图里河", "code": "101081016" }, { "city": "扎赉诺尔", "code": "101081017" }, {
    "city": "乌兰浩特",
    "code": "101081101"
}, { "city": "阿尔山", "code": "101081102" }, { "city": "科右中旗", "code": "101081103" }, {
    "city": "胡尔勒",
    "code": "101081104"
}, { "city": "扎赉特", "code": "101081105" }, { "city": "索伦", "code": "101081106" }, {
    "city": "突泉",
    "code": "101081107"
}, { "city": "兴安盟", "code": "101081108" }, { "city": "科右前旗", "code": "101081109" }, {
    "city": "高力板",
    "code": "101081110"
}, { "city": "阿左旗", "code": "101081201" }, { "city": "阿右旗", "code": "101081202" }, {
    "city": "额济纳",
    "code": "101081203"
}, { "city": "拐子湖", "code": "101081204" }, { "city": "吉兰太", "code": "101081205" }, {
    "city": "巴彦诺日公",
    "code": "101081209"
}, { "city": "雅布赖", "code": "101081210" }, { "city": "乌斯太", "code": "101081211" }, {
    "city": "孪井滩",
    "code": "101081212"
}, { "city": "阿拉善盟", "code": "101081213" }, { "city": "石家庄", "code": "101090101" }, {
    "city": "井陉",
    "code": "101090102"
}, { "city": "正定", "code": "101090103" }, { "city": "栾城", "code": "101090104" }, {
    "city": "行唐",
    "code": "101090105"
}, { "city": "灵寿", "code": "101090106" }, { "city": "高邑", "code": "101090107" }, {
    "city": "深泽",
    "code": "101090108"
}, { "city": "赞皇", "code": "101090109" }, { "city": "无极", "code": "101090110" }, {
    "city": "平山",
    "code": "101090111"
}, { "city": "元氏", "code": "101090112" }, { "city": "赵县", "code": "101090113" }, {
    "city": "辛集",
    "code": "101090114"
}, { "city": "藁城", "code": "101090115" }, { "city": "晋州", "code": "101090116" }, {
    "city": "新乐",
    "code": "101090117"
}, { "city": "鹿泉", "code": "101090118" }, { "city": "长安", "code": "101090119" }, {
    "city": "桥西",
    "code": "101090120"
}, { "city": "新华", "code": "101090121" }, { "city": "井陉矿区", "code": "101090122" }, {
    "city": "裕华",
    "code": "101090123"
}, { "city": "保定", "code": "101090201" }, { "city": "满城", "code": "101090202" }, {
    "city": "阜平",
    "code": "101090203"
}, { "city": "徐水", "code": "101090204" }, { "city": "唐县", "code": "101090205" }, {
    "city": "高阳",
    "code": "101090206"
}, { "city": "竞秀", "code": "101090208" }, { "city": "涞源", "code": "101090209" }, {
    "city": "望都",
    "code": "101090210"
}, { "city": "易县", "code": "101090212" }, { "city": "莲池", "code": "101090213" }, {
    "city": "曲阳",
    "code": "101090214"
}, { "city": "蠡县", "code": "101090215" }, { "city": "顺平", "code": "101090216" }, {
    "city": "涿州",
    "code": "101090218"
}, { "city": "定州", "code": "101090219" }, { "city": "安国", "code": "101090220" }, {
    "city": "高碑店",
    "code": "101090221"
}, { "city": "涞水", "code": "101090222" }, { "city": "定兴", "code": "101090223" }, {
    "city": "清苑",
    "code": "101090224"
}, { "city": "博野", "code": "101090225" }, { "city": "张家口", "code": "101090301" }, {
    "city": "宣化",
    "code": "101090302"
}, { "city": "张北", "code": "101090303" }, { "city": "康保", "code": "101090304" }, {
    "city": "沽源",
    "code": "101090305"
}, { "city": "尚义", "code": "101090306" }, { "city": "蔚县", "code": "101090307" }, {
    "city": "阳原",
    "code": "101090308"
}, { "city": "怀安", "code": "101090309" }, { "city": "万全", "code": "101090310" }, {
    "city": "怀来",
    "code": "101090311"
}, { "city": "涿鹿", "code": "101090312" }, { "city": "赤城", "code": "101090313" }, {
    "city": "崇礼",
    "code": "101090314"
}, { "city": "桥东", "code": "101090315" }, { "city": "桥西", "code": "101090316" }, {
    "city": "下花园",
    "code": "101090317"
}, { "city": "双桥", "code": "101090401" }, { "city": "承德", "code": "101090402" }, {
    "city": "承德县",
    "code": "101090403"
}, { "city": "兴隆", "code": "101090404" }, { "city": "平泉", "code": "101090405" }, {
    "city": "滦平",
    "code": "101090406"
}, { "city": "隆化", "code": "101090407" }, { "city": "丰宁", "code": "101090408" }, {
    "city": "宽城",
    "code": "101090409"
}, { "city": "围场", "code": "101090410" }, { "city": "双滦", "code": "101090411" }, {
    "city": "鹰手营子矿",
    "code": "101090412"
}, { "city": "唐山", "code": "101090501" }, { "city": "丰南", "code": "101090502" }, {
    "city": "丰润",
    "code": "101090503"
}, { "city": "滦县", "code": "101090504" }, { "city": "滦南", "code": "101090505" }, {
    "city": "乐亭",
    "code": "101090506"
}, { "city": "迁西", "code": "101090507" }, { "city": "玉田", "code": "101090508" }, {
    "city": "曹妃甸",
    "code": "101090509"
}, { "city": "遵化", "code": "101090510" }, { "city": "迁安", "code": "101090511" }, {
    "city": "路南",
    "code": "101090513"
}, { "city": "路北", "code": "101090514" }, { "city": "古冶", "code": "101090515" }, {
    "city": "开平",
    "code": "101090516"
}, { "city": "廊坊", "code": "101090601" }, { "city": "固安", "code": "101090602" }, {
    "city": "永清",
    "code": "101090603"
}, { "city": "香河", "code": "101090604" }, { "city": "大城", "code": "101090605" }, {
    "city": "文安",
    "code": "101090606"
}, { "city": "大厂", "code": "101090607" }, { "city": "霸州", "code": "101090608" }, {
    "city": "三河",
    "code": "101090609"
}, { "city": "安次", "code": "101090610" }, { "city": "广阳", "code": "101090611" }, {
    "city": "沧州",
    "code": "101090701"
}, { "city": "青县", "code": "101090702" }, { "city": "东光", "code": "101090703" }, {
    "city": "海兴",
    "code": "101090704"
}, { "city": "盐山", "code": "101090705" }, { "city": "肃宁", "code": "101090706" }, {
    "city": "南皮",
    "code": "101090707"
}, { "city": "吴桥", "code": "101090708" }, { "city": "献县", "code": "101090709" }, {
    "city": "孟村",
    "code": "101090710"
}, { "city": "泊头", "code": "101090711" }, { "city": "任丘", "code": "101090712" }, {
    "city": "黄骅",
    "code": "101090713"
}, { "city": "河间", "code": "101090714" }, { "city": "新华", "code": "101090715" }, {
    "city": "沧县",
    "code": "101090716"
}, { "city": "运河", "code": "101090717" }, { "city": "衡水", "code": "101090801" }, {
    "city": "枣强",
    "code": "101090802"
}, { "city": "武邑", "code": "101090803" }, { "city": "武强", "code": "101090804" }, {
    "city": "饶阳",
    "code": "101090805"
}, { "city": "安平", "code": "101090806" }, { "city": "故城", "code": "101090807" }, {
    "city": "景县",
    "code": "101090808"
}, { "city": "阜城", "code": "101090809" }, { "city": "冀州", "code": "101090810" }, {
    "city": "深州",
    "code": "101090811"
}, { "city": "桃城", "code": "101090812" }, { "city": "邢台", "code": "101090901" }, {
    "city": "临城",
    "code": "101090902"
}, { "city": "桥东", "code": "101090903" }, { "city": "内丘", "code": "101090904" }, {
    "city": "柏乡",
    "code": "101090905"
}, { "city": "隆尧", "code": "101090906" }, { "city": "南和", "code": "101090907" }, {
    "city": "宁晋",
    "code": "101090908"
}, { "city": "巨鹿", "code": "101090909" }, { "city": "新河", "code": "101090910" }, {
    "city": "广宗",
    "code": "101090911"
}, { "city": "平乡", "code": "101090912" }, { "city": "威县", "code": "101090913" }, {
    "city": "清河",
    "code": "101090914"
}, { "city": "临西", "code": "101090915" }, { "city": "南宫", "code": "101090916" }, {
    "city": "沙河",
    "code": "101090917"
}, { "city": "任县", "code": "101090918" }, { "city": "桥西", "code": "101090919" }, {
    "city": "邯郸",
    "code": "101091001"
}, { "city": "峰峰", "code": "101091002" }, { "city": "临漳", "code": "101091003" }, {
    "city": "成安",
    "code": "101091004"
}, { "city": "大名", "code": "101091005" }, { "city": "涉县", "code": "101091006" }, {
    "city": "磁县",
    "code": "101091007"
}, { "city": "肥乡", "code": "101091008" }, { "city": "永年", "code": "101091009" }, {
    "city": "邱县",
    "code": "101091010"
}, { "city": "鸡泽", "code": "101091011" }, { "city": "广平", "code": "101091012" }, {
    "city": "馆陶",
    "code": "101091013"
}, { "city": "魏县", "code": "101091014" }, { "city": "曲周", "code": "101091015" }, {
    "city": "武安",
    "code": "101091016"
}, { "city": "邯山", "code": "101091017" }, { "city": "丛台", "code": "101091018" }, {
    "city": "复兴",
    "code": "101091019"
}, { "city": "秦皇岛", "code": "101091101" }, { "city": "青龙", "code": "101091102" }, {
    "city": "昌黎",
    "code": "101091103"
}, { "city": "抚宁", "code": "101091104" }, { "city": "卢龙", "code": "101091105" }, {
    "city": "北戴河",
    "code": "101091106"
}, { "city": "海港", "code": "101091107" }, { "city": "山海关", "code": "101091108" }, {
    "city": "雄安新区",
    "code": "101091201"
}, { "city": "容城", "code": "101091202" }, { "city": "安新", "code": "101091203" }, {
    "city": "雄县",
    "code": "101091204"
}, { "city": "太原", "code": "101100101" }, { "city": "清徐", "code": "101100102" }, {
    "city": "阳曲",
    "code": "101100103"
}, { "city": "娄烦", "code": "101100104" }, { "city": "古交", "code": "101100105" }, {
    "city": "尖草坪区",
    "code": "101100106"
}, { "city": "小店区", "code": "101100107" }, { "city": "迎泽", "code": "101100108" }, {
    "city": "杏花岭",
    "code": "101100109"
}, { "city": "万柏林", "code": "101100110" }, { "city": "晋源", "code": "101100111" }, {
    "city": "大同",
    "code": "101100201"
}, { "city": "阳高", "code": "101100202" }, { "city": "大同县", "code": "101100203" }, {
    "city": "天镇",
    "code": "101100204"
}, { "city": "广灵", "code": "101100205" }, { "city": "灵丘", "code": "101100206" }, {
    "city": "浑源",
    "code": "101100207"
}, { "city": "左云", "code": "101100208" }, { "city": "矿区", "code": "101100209" }, {
    "city": "南郊",
    "code": "101100210"
}, { "city": "新荣", "code": "101100211" }, { "city": "阳泉", "code": "101100301" }, {
    "city": "盂县",
    "code": "101100302"
}, { "city": "平定", "code": "101100303" }, { "city": "矿区", "code": "101100304" }, {
    "city": "郊区",
    "code": "101100305"
}, { "city": "晋中", "code": "101100401" }, { "city": "榆次", "code": "101100402" }, {
    "city": "榆社",
    "code": "101100403"
}, { "city": "左权", "code": "101100404" }, { "city": "和顺", "code": "101100405" }, {
    "city": "昔阳",
    "code": "101100406"
}, { "city": "寿阳", "code": "101100407" }, { "city": "太谷", "code": "101100408" }, {
    "city": "祁县",
    "code": "101100409"
}, { "city": "平遥", "code": "101100410" }, { "city": "灵石", "code": "101100411" }, {
    "city": "介休",
    "code": "101100412"
}, { "city": "长治", "code": "101100501" }, { "city": "黎城", "code": "101100502" }, {
    "city": "屯留",
    "code": "101100503"
}, { "city": "潞城", "code": "101100504" }, { "city": "襄垣", "code": "101100505" }, {
    "city": "平顺",
    "code": "101100506"
}, { "city": "武乡", "code": "101100507" }, { "city": "沁县", "code": "101100508" }, {
    "city": "长子",
    "code": "101100509"
}, { "city": "沁源", "code": "101100510" }, { "city": "壶关", "code": "101100511" }, {
    "city": "郊区",
    "code": "101100512"
}, { "city": "晋城", "code": "101100601" }, { "city": "沁水", "code": "101100602" }, {
    "city": "阳城",
    "code": "101100603"
}, { "city": "陵川", "code": "101100604" }, { "city": "高平", "code": "101100605" }, {
    "city": "泽州",
    "code": "101100606"
}, { "city": "临汾", "code": "101100701" }, { "city": "曲沃", "code": "101100702" }, {
    "city": "永和",
    "code": "101100703"
}, { "city": "隰县", "code": "101100704" }, { "city": "大宁", "code": "101100705" }, {
    "city": "吉县",
    "code": "101100706"
}, { "city": "襄汾", "code": "101100707" }, { "city": "蒲县", "code": "101100708" }, {
    "city": "汾西",
    "code": "101100709"
}, { "city": "洪洞", "code": "101100710" }, { "city": "霍州", "code": "101100711" }, {
    "city": "乡宁",
    "code": "101100712"
}, { "city": "翼城", "code": "101100713" }, { "city": "侯马", "code": "101100714" }, {
    "city": "浮山",
    "code": "101100715"
}, { "city": "安泽", "code": "101100716" }, { "city": "古县", "code": "101100717" }, {
    "city": "尧都",
    "code": "101100718"
}, { "city": "运城", "code": "101100801" }, { "city": "临猗", "code": "101100802" }, {
    "city": "稷山",
    "code": "101100803"
}, { "city": "万荣", "code": "101100804" }, { "city": "河津", "code": "101100805" }, {
    "city": "新绛",
    "code": "101100806"
}, { "city": "绛县", "code": "101100807" }, { "city": "闻喜", "code": "101100808" }, {
    "city": "垣曲",
    "code": "101100809"
}, { "city": "永济", "code": "101100810" }, { "city": "芮城", "code": "101100811" }, {
    "city": "夏县",
    "code": "101100812"
}, { "city": "平陆", "code": "101100813" }, { "city": "盐湖", "code": "101100814" }, {
    "city": "朔州",
    "code": "101100901"
}, { "city": "平鲁", "code": "101100902" }, { "city": "山阴", "code": "101100903" }, {
    "city": "右玉",
    "code": "101100904"
}, { "city": "应县", "code": "101100905" }, { "city": "怀仁", "code": "101100906" }, {
    "city": "朔城",
    "code": "101100907"
}, { "city": "忻州", "code": "101101001" }, { "city": "定襄", "code": "101101002" }, {
    "city": "五台县",
    "code": "101101003"
}, { "city": "河曲", "code": "101101004" }, { "city": "偏关", "code": "101101005" }, {
    "city": "神池",
    "code": "101101006"
}, { "city": "宁武", "code": "101101007" }, { "city": "代县", "code": "101101008" }, {
    "city": "繁峙",
    "code": "101101009"
}, { "city": "五台山", "code": "101101010" }, { "city": "保德", "code": "101101011" }, {
    "city": "静乐",
    "code": "101101012"
}, { "city": "岢岚", "code": "101101013" }, { "city": "五寨", "code": "101101014" }, {
    "city": "原平",
    "code": "101101015"
}, { "city": "忻府", "code": "101101016" }, { "city": "吕梁", "code": "101101100" }, {
    "city": "离石",
    "code": "101101101"
}, { "city": "临县", "code": "101101102" }, { "city": "兴县", "code": "101101103" }, {
    "city": "岚县",
    "code": "101101104"
}, { "city": "柳林", "code": "101101105" }, { "city": "石楼", "code": "101101106" }, {
    "city": "方山",
    "code": "101101107"
}, { "city": "交口", "code": "101101108" }, { "city": "中阳", "code": "101101109" }, {
    "city": "孝义",
    "code": "101101110"
}, { "city": "汾阳", "code": "101101111" }, { "city": "文水", "code": "101101112" }, {
    "city": "交城",
    "code": "101101113"
}, { "city": "西安", "code": "101110101" }, { "city": "长安", "code": "101110102" }, {
    "city": "临潼",
    "code": "101110103"
}, { "city": "蓝田", "code": "101110104" }, { "city": "周至", "code": "101110105" }, {
    "city": "鄠邑",
    "code": "101110106"
}, { "city": "高陵", "code": "101110107" }, { "city": "新城", "code": "101110108" }, {
    "city": "碑林",
    "code": "101110109"
}, { "city": "莲湖", "code": "101110110" }, { "city": "灞桥", "code": "101110111" }, {
    "city": "未央",
    "code": "101110112"
}, { "city": "雁塔", "code": "101110113" }, { "city": "阎良", "code": "101110114" }, {
    "city": "咸阳",
    "code": "101110200"
}, { "city": "三原", "code": "101110201" }, { "city": "礼泉", "code": "101110202" }, {
    "city": "永寿",
    "code": "101110203"
}, { "city": "淳化", "code": "101110204" }, { "city": "泾阳", "code": "101110205" }, {
    "city": "武功",
    "code": "101110206"
}, { "city": "乾县", "code": "101110207" }, { "city": "彬县", "code": "101110208" }, {
    "city": "长武",
    "code": "101110209"
}, { "city": "旬邑", "code": "101110210" }, { "city": "兴平", "code": "101110211" }, {
    "city": "秦都",
    "code": "101110212"
}, { "city": "渭城", "code": "101110213" }, { "city": "延安", "code": "101110300" }, {
    "city": "延长",
    "code": "101110301"
}, { "city": "延川", "code": "101110302" }, { "city": "子长", "code": "101110303" }, {
    "city": "宜川",
    "code": "101110304"
}, { "city": "富县", "code": "101110305" }, { "city": "志丹", "code": "101110306" }, {
    "city": "安塞",
    "code": "101110307"
}, { "city": "甘泉", "code": "101110308" }, { "city": "洛川", "code": "101110309" }, {
    "city": "黄陵",
    "code": "101110310"
}, { "city": "黄龙", "code": "101110311" }, { "city": "吴起", "code": "101110312" }, {
    "city": "宝塔",
    "code": "101110313"
}, { "city": "榆林", "code": "101110401" }, { "city": "府谷", "code": "101110402" }, {
    "city": "神木",
    "code": "101110403"
}, { "city": "佳县", "code": "101110404" }, { "city": "定边", "code": "101110405" }, {
    "city": "靖边",
    "code": "101110406"
}, { "city": "横山", "code": "101110407" }, { "city": "米脂", "code": "101110408" }, {
    "city": "子洲",
    "code": "101110409"
}, { "city": "绥德", "code": "101110410" }, { "city": "吴堡", "code": "101110411" }, {
    "city": "清涧",
    "code": "101110412"
}, { "city": "榆阳", "code": "101110413" }, { "city": "渭南", "code": "101110501" }, {
    "city": "潼关",
    "code": "101110503"
}, { "city": "大荔", "code": "101110504" }, { "city": "白水", "code": "101110505" }, {
    "city": "富平",
    "code": "101110506"
}, { "city": "蒲城", "code": "101110507" }, { "city": "澄城", "code": "101110508" }, {
    "city": "合阳",
    "code": "101110509"
}, { "city": "韩城", "code": "101110510" }, { "city": "华阴", "code": "101110511" }, {
    "city": "临渭",
    "code": "101110512"
}, { "city": "华州", "code": "101110513" }, { "city": "商洛", "code": "101110601" }, {
    "city": "洛南",
    "code": "101110602"
}, { "city": "柞水", "code": "101110603" }, { "city": "商州", "code": "101110604" }, {
    "city": "镇安",
    "code": "101110605"
}, { "city": "丹凤", "code": "101110606" }, { "city": "商南", "code": "101110607" }, {
    "city": "山阳",
    "code": "101110608"
}, { "city": "安康", "code": "101110701" }, { "city": "紫阳", "code": "101110702" }, {
    "city": "石泉",
    "code": "101110703"
}, { "city": "汉阴", "code": "101110704" }, { "city": "旬阳", "code": "101110705" }, {
    "city": "岚皋",
    "code": "101110706"
}, { "city": "平利", "code": "101110707" }, { "city": "白河", "code": "101110708" }, {
    "city": "镇坪",
    "code": "101110709"
}, { "city": "宁陕", "code": "101110710" }, { "city": "汉滨", "code": "101110711" }, {
    "city": "汉中",
    "code": "101110801"
}, { "city": "略阳", "code": "101110802" }, { "city": "勉县", "code": "101110803" }, {
    "city": "留坝",
    "code": "101110804"
}, { "city": "洋县", "code": "101110805" }, { "city": "城固", "code": "101110806" }, {
    "city": "西乡",
    "code": "101110807"
}, { "city": "佛坪", "code": "101110808" }, { "city": "宁强", "code": "101110809" }, {
    "city": "南郑",
    "code": "101110810"
}, { "city": "镇巴", "code": "101110811" }, { "city": "汉台", "code": "101110812" }, {
    "city": "宝鸡",
    "code": "101110901"
}, { "city": "渭滨", "code": "101110902" }, { "city": "千阳", "code": "101110903" }, {
    "city": "麟游",
    "code": "101110904"
}, { "city": "岐山", "code": "101110905" }, { "city": "凤翔", "code": "101110906" }, {
    "city": "扶风",
    "code": "101110907"
}, { "city": "眉县", "code": "101110908" }, { "city": "太白", "code": "101110909" }, {
    "city": "凤县",
    "code": "101110910"
}, { "city": "陇县", "code": "101110911" }, { "city": "陈仓", "code": "101110912" }, {
    "city": "金台",
    "code": "101110913"
}, { "city": "铜川", "code": "101111001" }, { "city": "宜君", "code": "101111003" }, {
    "city": "耀州",
    "code": "101111004"
}, { "city": "王益", "code": "101111005" }, { "city": "印台", "code": "101111006" }, {
    "city": "杨凌",
    "code": "101111101"
}, { "city": "杨陵", "code": "101111102" }, { "city": "济南", "code": "101120101" }, {
    "city": "长清",
    "code": "101120102"
}, { "city": "商河", "code": "101120103" }, { "city": "章丘", "code": "101120104" }, {
    "city": "平阴",
    "code": "101120105"
}, { "city": "济阳", "code": "101120106" }, { "city": "历下", "code": "101120107" }, {
    "city": "市中",
    "code": "101120108"
}, { "city": "槐荫", "code": "101120109" }, { "city": "天桥", "code": "101120110" }, {
    "city": "历城",
    "code": "101120111"
}, { "city": "青岛", "code": "101120201" }, { "city": "崂山", "code": "101120202" }, {
    "city": "市南",
    "code": "101120203"
}, { "city": "即墨", "code": "101120204" }, { "city": "胶州", "code": "101120205" }, {
    "city": "黄岛",
    "code": "101120206"
}, { "city": "莱西", "code": "101120207" }, { "city": "平度", "code": "101120208" }, {
    "city": "市北",
    "code": "101120209"
}, { "city": "李沧", "code": "101120210" }, { "city": "城阳", "code": "101120211" }, {
    "city": "淄博",
    "code": "101120301"
}, { "city": "淄川", "code": "101120302" }, { "city": "博山", "code": "101120303" }, {
    "city": "高青",
    "code": "101120304"
}, { "city": "周村", "code": "101120305" }, { "city": "沂源", "code": "101120306" }, {
    "city": "桓台",
    "code": "101120307"
}, { "city": "临淄", "code": "101120308" }, { "city": "张店", "code": "101120309" }, {
    "city": "德州",
    "code": "101120401"
}, { "city": "武城", "code": "101120402" }, { "city": "临邑", "code": "101120403" }, {
    "city": "陵县",
    "code": "101120404"
}, { "city": "齐河", "code": "101120405" }, { "city": "乐陵", "code": "101120406" }, {
    "city": "庆云",
    "code": "101120407"
}, { "city": "平原", "code": "101120408" }, { "city": "宁津", "code": "101120409" }, {
    "city": "夏津",
    "code": "101120410"
}, { "city": "禹城", "code": "101120411" }, { "city": "德城", "code": "101120412" }, {
    "city": "陵城",
    "code": "101120413"
}, { "city": "烟台", "code": "101120501" }, { "city": "莱州", "code": "101120502" }, {
    "city": "长岛",
    "code": "101120503"
}, { "city": "蓬莱", "code": "101120504" }, { "city": "龙口", "code": "101120505" }, {
    "city": "招远",
    "code": "101120506"
}, { "city": "栖霞", "code": "101120507" }, { "city": "福山", "code": "101120508" }, {
    "city": "牟平",
    "code": "101120509"
}, { "city": "莱阳", "code": "101120510" }, { "city": "海阳", "code": "101120511" }, {
    "city": "芝罘",
    "code": "101120512"
}, { "city": "莱山", "code": "101120513" }, { "city": "潍坊", "code": "101120601" }, {
    "city": "青州",
    "code": "101120602"
}, { "city": "寿光", "code": "101120603" }, { "city": "临朐", "code": "101120604" }, {
    "city": "昌乐",
    "code": "101120605"
}, { "city": "昌邑", "code": "101120606" }, { "city": "安丘", "code": "101120607" }, {
    "city": "高密",
    "code": "101120608"
}, { "city": "诸城", "code": "101120609" }, { "city": "潍城", "code": "101120610" }, {
    "city": "寒亭",
    "code": "101120611"
}, { "city": "坊子", "code": "101120612" }, { "city": "奎文", "code": "101120613" }, {
    "city": "济宁",
    "code": "101120701"
}, { "city": "嘉祥", "code": "101120702" }, { "city": "微山", "code": "101120703" }, {
    "city": "鱼台",
    "code": "101120704"
}, { "city": "兖州", "code": "101120705" }, { "city": "金乡", "code": "101120706" }, {
    "city": "汶上",
    "code": "101120707"
}, { "city": "泗水", "code": "101120708" }, { "city": "梁山", "code": "101120709" }, {
    "city": "曲阜",
    "code": "101120710"
}, { "city": "邹城", "code": "101120711" }, { "city": "任城", "code": "101120712" }, {
    "city": "泰安",
    "code": "101120801"
}, { "city": "新泰", "code": "101120802" }, { "city": "泰山", "code": "101120803" }, {
    "city": "肥城",
    "code": "101120804"
}, { "city": "东平", "code": "101120805" }, { "city": "宁阳", "code": "101120806" }, {
    "city": "岱岳",
    "code": "101120807"
}, { "city": "临沂", "code": "101120901" }, { "city": "莒南", "code": "101120902" }, {
    "city": "沂南",
    "code": "101120903"
}, { "city": "兰陵", "code": "101120904" }, { "city": "临沭", "code": "101120905" }, {
    "city": "郯城",
    "code": "101120906"
}, { "city": "蒙阴", "code": "101120907" }, { "city": "平邑", "code": "101120908" }, {
    "city": "费县",
    "code": "101120909"
}, { "city": "沂水", "code": "101120910" }, { "city": "兰山", "code": "101120911" }, {
    "city": "罗庄",
    "code": "101120912"
}, { "city": "河东", "code": "101120913" }, { "city": "菏泽", "code": "101121001" }, {
    "city": "鄄城",
    "code": "101121002"
}, { "city": "郓城", "code": "101121003" }, { "city": "东明", "code": "101121004" }, {
    "city": "定陶",
    "code": "101121005"
}, { "city": "巨野", "code": "101121006" }, { "city": "曹县", "code": "101121007" }, {
    "city": "成武",
    "code": "101121008"
}, { "city": "单县", "code": "101121009" }, { "city": "牡丹", "code": "101121010" }, {
    "city": "滨州",
    "code": "101121101"
}, { "city": "博兴", "code": "101121102" }, { "city": "无棣", "code": "101121103" }, {
    "city": "阳信",
    "code": "101121104"
}, { "city": "惠民", "code": "101121105" }, { "city": "沾化", "code": "101121106" }, {
    "city": "邹平",
    "code": "101121107"
}, { "city": "滨城", "code": "101121108" }, { "city": "东营", "code": "101121201" }, {
    "city": "河口",
    "code": "101121202"
}, { "city": "垦利", "code": "101121203" }, { "city": "利津", "code": "101121204" }, {
    "city": "广饶",
    "code": "101121205"
}, { "city": "威海", "code": "101121301" }, { "city": "文登", "code": "101121302" }, {
    "city": "荣成",
    "code": "101121303"
}, { "city": "乳山", "code": "101121304" }, { "city": "成山头", "code": "101121305" }, {
    "city": "石岛",
    "code": "101121306"
}, { "city": "环翠", "code": "101121307" }, { "city": "枣庄", "code": "101121401" }, {
    "city": "薛城",
    "code": "101121402"
}, { "city": "峄城", "code": "101121403" }, { "city": "台儿庄", "code": "101121404" }, {
    "city": "滕州",
    "code": "101121405"
}, { "city": "市中", "code": "101121406" }, { "city": "山亭", "code": "101121407" }, {
    "city": "日照",
    "code": "101121501"
}, { "city": "五莲", "code": "101121502" }, { "city": "莒县", "code": "101121503" }, {
    "city": "东港",
    "code": "101121504"
}, { "city": "岚山", "code": "101121505" }, { "city": "莱芜", "code": "101121601" }, {
    "city": "莱城",
    "code": "101121602"
}, { "city": "钢城", "code": "101121603" }, { "city": "聊城", "code": "101121701" }, {
    "city": "冠县",
    "code": "101121702"
}, { "city": "阳谷", "code": "101121703" }, { "city": "高唐", "code": "101121704" }, {
    "city": "茌平",
    "code": "101121705"
}, { "city": "东阿", "code": "101121706" }, { "city": "临清", "code": "101121707" }, {
    "city": "东昌府",
    "code": "101121708"
}, { "city": "莘县", "code": "101121709" }, { "city": "乌鲁木齐", "code": "101130101" }, {
    "city": "天山",
    "code": "101130102"
}, { "city": "小渠子", "code": "101130103" }, { "city": "沙依巴克", "code": "101130104" }, {
    "city": "达坂城",
    "code": "101130105"
}, { "city": "新市", "code": "101130106" }, { "city": "水磨沟", "code": "101130107" }, {
    "city": "天池",
    "code": "101130109"
}, { "city": "头屯河", "code": "101130111" }, { "city": "米东", "code": "101130112" }, {
    "city": "乌鲁木齐县",
    "code": "101130113"
}, { "city": "西白杨沟", "code": "101130114" }, { "city": "克拉玛依", "code": "101130201" }, {
    "city": "乌尔禾",
    "code": "101130202"
}, { "city": "白碱滩", "code": "101130203" }, { "city": "独山子", "code": "101130204" }, {
    "city": "石河子",
    "code": "101130301"
}, { "city": "炮台", "code": "101130302" }, { "city": "莫索湾", "code": "101130303" }, {
    "city": "昌吉",
    "code": "101130401"
}, { "city": "呼图壁", "code": "101130402" }, { "city": "阜康", "code": "101130404" }, {
    "city": "吉木萨尔",
    "code": "101130405"
}, { "city": "奇台", "code": "101130406" }, { "city": "玛纳斯", "code": "101130407" }, {
    "city": "木垒",
    "code": "101130408"
}, { "city": "蔡家湖", "code": "101130409" }, { "city": "吐鲁番", "code": "101130501" }, {
    "city": "托克逊",
    "code": "101130502"
}, { "city": "高昌", "code": "101130503" }, { "city": "鄯善", "code": "101130504" }, {
    "city": "库尔勒",
    "code": "101130601"
}, { "city": "轮台", "code": "101130602" }, { "city": "尉犁", "code": "101130603" }, {
    "city": "若羌",
    "code": "101130604"
}, { "city": "且末", "code": "101130605" }, { "city": "和静", "code": "101130606" }, {
    "city": "焉耆",
    "code": "101130607"
}, { "city": "和硕", "code": "101130608" }, { "city": "巴音郭楞", "code": "101130609" }, {
    "city": "巴音布鲁克",
    "code": "101130610"
}, { "city": "铁干里克", "code": "101130611" }, { "city": "博湖", "code": "101130612" }, {
    "city": "塔中",
    "code": "101130613"
}, { "city": "巴仑台", "code": "101130614" }, { "city": "阿拉尔", "code": "101130701" }, {
    "city": "阿克苏",
    "code": "101130801"
}, { "city": "乌什", "code": "101130802" }, { "city": "温宿", "code": "101130803" }, {
    "city": "拜城",
    "code": "101130804"
}, { "city": "新和", "code": "101130805" }, { "city": "沙雅", "code": "101130806" }, {
    "city": "库车",
    "code": "101130807"
}, { "city": "柯坪", "code": "101130808" }, { "city": "阿瓦提", "code": "101130809" }, {
    "city": "喀什",
    "code": "101130901"
}, { "city": "英吉沙", "code": "101130902" }, { "city": "塔什库尔干", "code": "101130903" }, {
    "city": "麦盖提",
    "code": "101130904"
}, { "city": "莎车", "code": "101130905" }, { "city": "叶城", "code": "101130906" }, {
    "city": "泽普",
    "code": "101130907"
}, { "city": "巴楚", "code": "101130908" }, { "city": "岳普湖", "code": "101130909" }, {
    "city": "伽师",
    "code": "101130910"
}, { "city": "疏附", "code": "101130911" }, { "city": "疏勒", "code": "101130912" }, {
    "city": "伊宁",
    "code": "101131001"
}, { "city": "察布查尔", "code": "101131002" }, { "city": "尼勒克", "code": "101131003" }, {
    "city": "伊宁县",
    "code": "101131004"
}, { "city": "巩留", "code": "101131005" }, { "city": "新源", "code": "101131006" }, {
    "city": "昭苏",
    "code": "101131007"
}, { "city": "特克斯", "code": "101131008" }, { "city": "霍城", "code": "101131009" }, {
    "city": "霍尔果斯",
    "code": "101131010"
}, { "city": "奎屯", "code": "101131011" }, { "city": "伊犁", "code": "101131012" }, {
    "city": "塔城",
    "code": "101131101"
}, { "city": "裕民", "code": "101131102" }, { "city": "额敏", "code": "101131103" }, {
    "city": "和布克赛尔",
    "code": "101131104"
}, { "city": "托里", "code": "101131105" }, { "city": "乌苏", "code": "101131106" }, {
    "city": "沙湾",
    "code": "101131107"
}, { "city": "哈密", "code": "101131201" }, { "city": "伊州", "code": "101131202" }, {
    "city": "巴里坤",
    "code": "101131203"
}, { "city": "伊吾", "code": "101131204" }, { "city": "和田", "code": "101131301" }, {
    "city": "皮山",
    "code": "101131302"
}, { "city": "策勒", "code": "101131303" }, { "city": "墨玉", "code": "101131304" }, {
    "city": "洛浦",
    "code": "101131305"
}, { "city": "民丰", "code": "101131306" }, { "city": "于田", "code": "101131307" }, {
    "city": "阿勒泰",
    "code": "101131401"
}, { "city": "哈巴河", "code": "101131402" }, { "city": "吉木乃", "code": "101131405" }, {
    "city": "布尔津",
    "code": "101131406"
}, { "city": "福海", "code": "101131407" }, { "city": "富蕴", "code": "101131408" }, {
    "city": "青河",
    "code": "101131409"
}, { "city": "阿图什", "code": "101131501" }, { "city": "乌恰", "code": "101131502" }, {
    "city": "阿克陶",
    "code": "101131503"
}, { "city": "阿合奇", "code": "101131504" }, { "city": "克州", "code": "101131505" }, {
    "city": "博乐",
    "code": "101131601"
}, { "city": "温泉", "code": "101131602" }, { "city": "精河", "code": "101131603" }, {
    "city": "博尔塔拉",
    "code": "101131604"
}, { "city": "阿拉山口", "code": "101131606" }, { "city": "图木舒克", "code": "101131701" }, {
    "city": "五家渠",
    "code": "101131801"
}, { "city": "铁门关", "code": "101131901" }, { "city": "昆玉", "code": "101131920" }, {
    "city": "北屯",
    "code": "101132101"
}, { "city": "双河", "code": "101132201" }, { "city": "可克达拉", "code": "101132301" }, {
    "city": "拉萨",
    "code": "101140101"
}, { "city": "当雄", "code": "101140102" }, { "city": "尼木", "code": "101140103" }, {
    "city": "林周",
    "code": "101140104"
}, { "city": "堆龙德庆", "code": "101140105" }, { "city": "曲水", "code": "101140106" }, {
    "city": "达孜",
    "code": "101140107"
}, { "city": "墨竹工卡", "code": "101140108" }, { "city": "城关", "code": "101140109" }, {
    "city": "日喀则",
    "code": "101140201"
}, { "city": "拉孜", "code": "101140202" }, { "city": "南木林", "code": "101140203" }, {
    "city": "聂拉木",
    "code": "101140204"
}, { "city": "定日", "code": "101140205" }, { "city": "江孜", "code": "101140206" }, {
    "city": "帕里",
    "code": "101140207"
}, { "city": "仲巴", "code": "101140208" }, { "city": "萨嘎", "code": "101140209" }, {
    "city": "吉隆",
    "code": "101140210"
}, { "city": "昂仁", "code": "101140211" }, { "city": "定结", "code": "101140212" }, {
    "city": "萨迦",
    "code": "101140213"
}, { "city": "谢通门", "code": "101140214" }, { "city": "桑珠孜", "code": "101140215" }, {
    "city": "岗巴",
    "code": "101140216"
}, { "city": "白朗", "code": "101140217" }, { "city": "亚东", "code": "101140218" }, {
    "city": "康马",
    "code": "101140219"
}, { "city": "仁布", "code": "101140220" }, { "city": "山南", "code": "101140301" }, {
    "city": "贡嘎",
    "code": "101140302"
}, { "city": "扎囊", "code": "101140303" }, { "city": "加查", "code": "101140304" }, {
    "city": "浪卡子",
    "code": "101140305"
}, { "city": "错那", "code": "101140306" }, { "city": "隆子", "code": "101140307" }, {
    "city": "泽当",
    "code": "101140308"
}, { "city": "乃东", "code": "101140309" }, { "city": "桑日", "code": "101140310" }, {
    "city": "洛扎",
    "code": "101140311"
}, { "city": "措美", "code": "101140312" }, { "city": "琼结", "code": "101140313" }, {
    "city": "曲松",
    "code": "101140314"
}, { "city": "林芝", "code": "101140401" }, { "city": "波密", "code": "101140402" }, {
    "city": "米林",
    "code": "101140403"
}, { "city": "察隅", "code": "101140404" }, { "city": "工布江达", "code": "101140405" }, {
    "city": "朗县",
    "code": "101140406"
}, { "city": "墨脱", "code": "101140407" }, { "city": "巴宜", "code": "101140408" }, {
    "city": "昌都",
    "code": "101140501"
}, { "city": "丁青", "code": "101140502" }, { "city": "边坝", "code": "101140503" }, {
    "city": "洛隆",
    "code": "101140504"
}, { "city": "左贡", "code": "101140505" }, { "city": "芒康", "code": "101140506" }, {
    "city": "类乌齐",
    "code": "101140507"
}, { "city": "八宿", "code": "101140508" }, { "city": "江达", "code": "101140509" }, {
    "city": "察雅",
    "code": "101140510"
}, { "city": "贡觉", "code": "101140511" }, { "city": "卡若", "code": "101140512" }, {
    "city": "那曲",
    "code": "101140601"
}, { "city": "尼玛", "code": "101140602" }, { "city": "嘉黎", "code": "101140603" }, {
    "city": "班戈",
    "code": "101140604"
}, { "city": "安多", "code": "101140605" }, { "city": "索县", "code": "101140606" }, {
    "city": "聂荣",
    "code": "101140607"
}, { "city": "巴青", "code": "101140608" }, { "city": "比如", "code": "101140609" }, {
    "city": "双湖",
    "code": "101140610"
}, { "city": "申扎", "code": "101140611" }, { "city": "色尼", "code": "101140612" }, {
    "city": "阿里",
    "code": "101140701"
}, { "city": "改则", "code": "101140702" }, { "city": "狮泉河", "code": "101140704" }, {
    "city": "普兰",
    "code": "101140705"
}, { "city": "札达", "code": "101140706" }, { "city": "噶尔", "code": "101140707" }, {
    "city": "日土",
    "code": "101140708"
}, { "city": "革吉", "code": "101140709" }, { "city": "措勤", "code": "101140710" }, {
    "city": "西宁",
    "code": "101150101"
}, { "city": "大通", "code": "101150102" }, { "city": "湟源", "code": "101150103" }, {
    "city": "湟中",
    "code": "101150104"
}, { "city": "城东", "code": "101150105" }, { "city": "城中", "code": "101150106" }, {
    "city": "城西",
    "code": "101150107"
}, { "city": "城北", "code": "101150108" }, { "city": "平安", "code": "101150201" }, {
    "city": "乐都",
    "code": "101150202"
}, { "city": "民和", "code": "101150203" }, { "city": "互助", "code": "101150204" }, {
    "city": "化隆",
    "code": "101150205"
}, { "city": "循化", "code": "101150206" }, { "city": "海东", "code": "101150207" }, {
    "city": "同仁",
    "code": "101150301"
}, { "city": "尖扎", "code": "101150302" }, { "city": "泽库", "code": "101150303" }, {
    "city": "河南",
    "code": "101150304"
}, { "city": "黄南", "code": "101150305" }, { "city": "共和", "code": "101150401" }, {
    "city": "海南",
    "code": "101150402"
}, { "city": "贵德", "code": "101150404" }, { "city": "兴海", "code": "101150406" }, {
    "city": "贵南",
    "code": "101150407"
}, { "city": "同德", "code": "101150408" }, { "city": "玛沁", "code": "101150501" }, {
    "city": "班玛",
    "code": "101150502"
}, { "city": "甘德", "code": "101150503" }, { "city": "达日", "code": "101150504" }, {
    "city": "久治",
    "code": "101150505"
}, { "city": "玛多", "code": "101150506" }, { "city": "果洛", "code": "101150507" }, {
    "city": "玉树",
    "code": "101150601"
}, { "city": "称多", "code": "101150602" }, { "city": "治多", "code": "101150603" }, {
    "city": "杂多",
    "code": "101150604"
}, { "city": "囊谦", "code": "101150605" }, { "city": "曲麻莱", "code": "101150606" }, {
    "city": "德令哈",
    "code": "101150701"
}, { "city": "海西", "code": "101150702" }, { "city": "天峻", "code": "101150708" }, {
    "city": "乌兰",
    "code": "101150709"
}, { "city": "茫崖", "code": "101150712" }, { "city": "大柴旦", "code": "101150713" }, {
    "city": "格尔木",
    "code": "101150714"
}, { "city": "都兰", "code": "101150715" }, { "city": "冷湖", "code": "101150716" }, {
    "city": "海晏",
    "code": "101150801"
}, { "city": "门源", "code": "101150802" }, { "city": "祁连", "code": "101150803" }, {
    "city": "海北",
    "code": "101150804"
}, { "city": "刚察", "code": "101150806" }, { "city": "兰州", "code": "101160101" }, {
    "city": "皋兰",
    "code": "101160102"
}, { "city": "永登", "code": "101160103" }, { "city": "榆中", "code": "101160104" }, {
    "city": "城关",
    "code": "101160105"
}, { "city": "七里河", "code": "101160106" }, { "city": "西固", "code": "101160107" }, {
    "city": "安宁",
    "code": "101160108"
}, { "city": "红古", "code": "101160109" }, { "city": "定西", "code": "101160201" }, {
    "city": "通渭",
    "code": "101160202"
}, { "city": "陇西", "code": "101160203" }, { "city": "渭源", "code": "101160204" }, {
    "city": "临洮",
    "code": "101160205"
}, { "city": "漳县", "code": "101160206" }, { "city": "岷县", "code": "101160207" }, {
    "city": "安定",
    "code": "101160208"
}, { "city": "平凉", "code": "101160301" }, { "city": "泾川", "code": "101160302" }, {
    "city": "灵台",
    "code": "101160303"
}, { "city": "崇信", "code": "101160304" }, { "city": "华亭", "code": "101160305" }, {
    "city": "庄浪",
    "code": "101160306"
}, { "city": "静宁", "code": "101160307" }, { "city": "崆峒", "code": "101160308" }, {
    "city": "庆阳",
    "code": "101160401"
}, { "city": "西峰", "code": "101160402" }, { "city": "环县", "code": "101160403" }, {
    "city": "华池",
    "code": "101160404"
}, { "city": "合水", "code": "101160405" }, { "city": "正宁", "code": "101160406" }, {
    "city": "宁县",
    "code": "101160407"
}, { "city": "镇原", "code": "101160408" }, { "city": "庆城", "code": "101160409" }, {
    "city": "武威",
    "code": "101160501"
}, { "city": "民勤", "code": "101160502" }, { "city": "古浪", "code": "101160503" }, {
    "city": "凉州",
    "code": "101160504"
}, { "city": "天祝", "code": "101160505" }, { "city": "金昌", "code": "101160601" }, {
    "city": "永昌",
    "code": "101160602"
}, { "city": "金川", "code": "101160603" }, { "city": "张掖", "code": "101160701" }, {
    "city": "肃南",
    "code": "101160702"
}, { "city": "民乐", "code": "101160703" }, { "city": "临泽", "code": "101160704" }, {
    "city": "高台",
    "code": "101160705"
}, { "city": "山丹", "code": "101160706" }, { "city": "甘州", "code": "101160707" }, {
    "city": "酒泉",
    "code": "101160801"
}, { "city": "肃州", "code": "101160802" }, { "city": "金塔", "code": "101160803" }, {
    "city": "阿克塞",
    "code": "101160804"
}, { "city": "瓜州", "code": "101160805" }, { "city": "肃北", "code": "101160806" }, {
    "city": "玉门",
    "code": "101160807"
}, { "city": "敦煌", "code": "101160808" }, { "city": "天水", "code": "101160901" }, {
    "city": "秦州",
    "code": "101160902"
}, { "city": "清水", "code": "101160903" }, { "city": "秦安", "code": "101160904" }, {
    "city": "甘谷",
    "code": "101160905"
}, { "city": "武山", "code": "101160906" }, { "city": "张家川", "code": "101160907" }, {
    "city": "麦积",
    "code": "101160908"
}, { "city": "武都", "code": "101161001" }, { "city": "成县", "code": "101161002" }, {
    "city": "文县",
    "code": "101161003"
}, { "city": "宕昌", "code": "101161004" }, { "city": "康县", "code": "101161005" }, {
    "city": "西和",
    "code": "101161006"
}, { "city": "礼县", "code": "101161007" }, { "city": "徽县", "code": "101161008" }, {
    "city": "两当",
    "code": "101161009"
}, { "city": "陇南", "code": "101161010" }, { "city": "临夏", "code": "101161101" }, {
    "city": "康乐",
    "code": "101161102"
}, { "city": "永靖", "code": "101161103" }, { "city": "广河", "code": "101161104" }, {
    "city": "和政",
    "code": "101161105"
}, { "city": "东乡", "code": "101161106" }, { "city": "积石山", "code": "101161107" }, {
    "city": "合作",
    "code": "101161201"
}, { "city": "临潭", "code": "101161202" }, { "city": "卓尼", "code": "101161203" }, {
    "city": "舟曲",
    "code": "101161204"
}, { "city": "迭部", "code": "101161205" }, { "city": "玛曲", "code": "101161206" }, {
    "city": "碌曲",
    "code": "101161207"
}, { "city": "夏河", "code": "101161208" }, { "city": "甘南", "code": "101161209" }, {
    "city": "白银",
    "code": "101161301"
}, { "city": "靖远", "code": "101161302" }, { "city": "会宁", "code": "101161303" }, {
    "city": "平川",
    "code": "101161304"
}, { "city": "景泰", "code": "101161305" }, { "city": "嘉峪关", "code": "101161401" }, {
    "city": "银川",
    "code": "101170101"
}, { "city": "永宁", "code": "101170102" }, { "city": "灵武", "code": "101170103" }, {
    "city": "贺兰",
    "code": "101170104"
}, { "city": "兴庆", "code": "101170105" }, { "city": "西夏", "code": "101170106" }, {
    "city": "金凤",
    "code": "101170107"
}, { "city": "石嘴山", "code": "101170201" }, { "city": "惠农", "code": "101170202" }, {
    "city": "平罗",
    "code": "101170203"
}, { "city": "陶乐", "code": "101170204" }, { "city": "大武口", "code": "101170205" }, {
    "city": "吴忠",
    "code": "101170301"
}, { "city": "同心", "code": "101170302" }, { "city": "盐池", "code": "101170303" }, {
    "city": "利通",
    "code": "101170304"
}, { "city": "红寺堡", "code": "101170305" }, { "city": "青铜峡", "code": "101170306" }, {
    "city": "固原",
    "code": "101170401"
}, { "city": "西吉", "code": "101170402" }, { "city": "隆德", "code": "101170403" }, {
    "city": "泾源",
    "code": "101170404"
}, { "city": "原州", "code": "101170405" }, { "city": "彭阳", "code": "101170406" }, {
    "city": "中卫",
    "code": "101170501"
}, { "city": "中宁", "code": "101170502" }, { "city": "沙坡头", "code": "101170503" }, {
    "city": "海原",
    "code": "101170504"
}, { "city": "郑州", "code": "101180101" }, { "city": "巩义", "code": "101180102" }, {
    "city": "荥阳",
    "code": "101180103"
}, { "city": "登封", "code": "101180104" }, { "city": "新密", "code": "101180105" }, {
    "city": "新郑",
    "code": "101180106"
}, { "city": "中牟", "code": "101180107" }, { "city": "上街", "code": "101180108" }, {
    "city": "中原",
    "code": "101180109"
}, { "city": "二七", "code": "101180110" }, { "city": "管城", "code": "101180111" }, {
    "city": "金水",
    "code": "101180112"
}, { "city": "惠济", "code": "101180113" }, { "city": "安阳", "code": "101180201" }, {
    "city": "汤阴",
    "code": "101180202"
}, { "city": "滑县", "code": "101180203" }, { "city": "内黄", "code": "101180204" }, {
    "city": "林州",
    "code": "101180205"
}, { "city": "文峰", "code": "101180206" }, { "city": "北关", "code": "101180207" }, {
    "city": "殷都",
    "code": "101180208"
}, { "city": "龙安", "code": "101180209" }, { "city": "新乡", "code": "101180301" }, {
    "city": "获嘉",
    "code": "101180302"
}, { "city": "原阳", "code": "101180303" }, { "city": "辉县", "code": "101180304" }, {
    "city": "卫辉",
    "code": "101180305"
}, { "city": "延津", "code": "101180306" }, { "city": "封丘", "code": "101180307" }, {
    "city": "长垣",
    "code": "101180308"
}, { "city": "红旗", "code": "101180309" }, { "city": "卫滨", "code": "101180310" }, {
    "city": "凤泉",
    "code": "101180311"
}, { "city": "牧野", "code": "101180312" }, { "city": "许昌", "code": "101180401" }, {
    "city": "鄢陵",
    "code": "101180402"
}, { "city": "襄城", "code": "101180403" }, { "city": "长葛", "code": "101180404" }, {
    "city": "禹州",
    "code": "101180405"
}, { "city": "魏都", "code": "101180406" }, { "city": "建安", "code": "101180407" }, {
    "city": "平顶山",
    "code": "101180501"
}, { "city": "郏县", "code": "101180502" }, { "city": "宝丰", "code": "101180503" }, {
    "city": "汝州",
    "code": "101180504"
}, { "city": "叶县", "code": "101180505" }, { "city": "舞钢", "code": "101180506" }, {
    "city": "鲁山",
    "code": "101180507"
}, { "city": "石龙", "code": "101180508" }, { "city": "新华", "code": "101180509" }, {
    "city": "卫东",
    "code": "101180510"
}, { "city": "湛河", "code": "101180511" }, { "city": "信阳", "code": "101180601" }, {
    "city": "息县",
    "code": "101180602"
}, { "city": "罗山", "code": "101180603" }, { "city": "光山", "code": "101180604" }, {
    "city": "新县",
    "code": "101180605"
}, { "city": "淮滨", "code": "101180606" }, { "city": "潢川", "code": "101180607" }, {
    "city": "固始",
    "code": "101180608"
}, { "city": "商城", "code": "101180609" }, { "city": "浉河", "code": "101180610" }, {
    "city": "平桥",
    "code": "101180611"
}, { "city": "南阳", "code": "101180701" }, { "city": "南召", "code": "101180702" }, {
    "city": "方城",
    "code": "101180703"
}, { "city": "社旗", "code": "101180704" }, { "city": "西峡", "code": "101180705" }, {
    "city": "内乡",
    "code": "101180706"
}, { "city": "镇平", "code": "101180707" }, { "city": "淅川", "code": "101180708" }, {
    "city": "新野",
    "code": "101180709"
}, { "city": "唐河", "code": "101180710" }, { "city": "邓州", "code": "101180711" }, {
    "city": "桐柏",
    "code": "101180712"
}, { "city": "宛城", "code": "101180713" }, { "city": "卧龙", "code": "101180714" }, {
    "city": "开封",
    "code": "101180801"
}, { "city": "杞县", "code": "101180802" }, { "city": "尉氏", "code": "101180803" }, {
    "city": "通许",
    "code": "101180804"
}, { "city": "兰考", "code": "101180805" }, { "city": "龙亭", "code": "101180806" }, {
    "city": "顺河",
    "code": "101180807"
}, { "city": "鼓楼", "code": "101180808" }, { "city": "禹王台", "code": "101180809" }, {
    "city": "祥符",
    "code": "101180810"
}, { "city": "洛阳", "code": "101180901" }, { "city": "新安", "code": "101180902" }, {
    "city": "孟津",
    "code": "101180903"
}, { "city": "宜阳", "code": "101180904" }, { "city": "洛宁", "code": "101180905" }, {
    "city": "伊川",
    "code": "101180906"
}, { "city": "嵩县", "code": "101180907" }, { "city": "偃师", "code": "101180908" }, {
    "city": "栾川",
    "code": "101180909"
}, { "city": "汝阳", "code": "101180910" }, { "city": "吉利", "code": "101180911" }, {
    "city": "老城",
    "code": "101180912"
}, { "city": "西工", "code": "101180913" }, { "city": "瀍河", "code": "101180914" }, {
    "city": "涧西",
    "code": "101180915"
}, { "city": "洛龙", "code": "101180916" }, { "city": "商丘", "code": "101181001" }, {
    "city": "梁园",
    "code": "101181002"
}, { "city": "睢县", "code": "101181003" }, { "city": "民权", "code": "101181004" }, {
    "city": "虞城",
    "code": "101181005"
}, { "city": "柘城", "code": "101181006" }, { "city": "宁陵", "code": "101181007" }, {
    "city": "夏邑",
    "code": "101181008"
}, { "city": "永城", "code": "101181009" }, { "city": "睢阳", "code": "101181010" }, {
    "city": "焦作",
    "code": "101181101"
}, { "city": "修武", "code": "101181102" }, { "city": "武陟", "code": "101181103" }, {
    "city": "沁阳",
    "code": "101181104"
}, { "city": "解放", "code": "101181105" }, { "city": "博爱", "code": "101181106" }, {
    "city": "温县",
    "code": "101181107"
}, { "city": "孟州", "code": "101181108" }, { "city": "中站", "code": "101181109" }, {
    "city": "马村",
    "code": "101181110"
}, { "city": "山阳", "code": "101181111" }, { "city": "鹤壁", "code": "101181201" }, {
    "city": "浚县",
    "code": "101181202"
}, { "city": "淇县", "code": "101181203" }, { "city": "鹤山", "code": "101181204" }, {
    "city": "山城",
    "code": "101181205"
}, { "city": "淇滨", "code": "101181206" }, { "city": "濮阳", "code": "101181301" }, {
    "city": "台前",
    "code": "101181302"
}, { "city": "南乐", "code": "101181303" }, { "city": "清丰", "code": "101181304" }, {
    "city": "范县",
    "code": "101181305"
}, { "city": "华龙", "code": "101181306" }, { "city": "周口", "code": "101181401" }, {
    "city": "扶沟",
    "code": "101181402"
}, { "city": "太康", "code": "101181403" }, { "city": "淮阳", "code": "101181404" }, {
    "city": "西华",
    "code": "101181405"
}, { "city": "商水", "code": "101181406" }, { "city": "项城", "code": "101181407" }, {
    "city": "郸城",
    "code": "101181408"
}, { "city": "鹿邑", "code": "101181409" }, { "city": "沈丘", "code": "101181410" }, {
    "city": "川汇",
    "code": "101181411"
}, { "city": "漯河", "code": "101181501" }, { "city": "临颍", "code": "101181502" }, {
    "city": "舞阳",
    "code": "101181503"
}, { "city": "源汇", "code": "101181504" }, { "city": "郾城", "code": "101181505" }, {
    "city": "召陵",
    "code": "101181506"
}, { "city": "驻马店", "code": "101181601" }, { "city": "西平", "code": "101181602" }, {
    "city": "遂平",
    "code": "101181603"
}, { "city": "上蔡", "code": "101181604" }, { "city": "汝南", "code": "101181605" }, {
    "city": "泌阳",
    "code": "101181606"
}, { "city": "平舆", "code": "101181607" }, { "city": "新蔡", "code": "101181608" }, {
    "city": "确山",
    "code": "101181609"
}, { "city": "正阳", "code": "101181610" }, { "city": "驿城", "code": "101181611" }, {
    "city": "三门峡",
    "code": "101181701"
}, { "city": "灵宝", "code": "101181702" }, { "city": "渑池", "code": "101181703" }, {
    "city": "卢氏",
    "code": "101181704"
}, { "city": "义马", "code": "101181705" }, { "city": "湖滨", "code": "101181707" }, {
    "city": "陕州",
    "code": "101181708"
}, { "city": "济源", "code": "101181801" }, { "city": "南京", "code": "101190101" }, {
    "city": "溧水",
    "code": "101190102"
}, { "city": "高淳", "code": "101190103" }, { "city": "江宁", "code": "101190104" }, {
    "city": "六合",
    "code": "101190105"
}, { "city": "浦口", "code": "101190107" }, { "city": "玄武", "code": "101190108" }, {
    "city": "秦淮",
    "code": "101190109"
}, { "city": "建邺", "code": "101190110" }, { "city": "鼓楼", "code": "101190111" }, {
    "city": "栖霞",
    "code": "101190112"
}, { "city": "雨花台", "code": "101190113" }, { "city": "无锡", "code": "101190201" }, {
    "city": "江阴",
    "code": "101190202"
}, { "city": "宜兴", "code": "101190203" }, { "city": "锡山", "code": "101190204" }, {
    "city": "惠山",
    "code": "101190205"
}, { "city": "滨湖", "code": "101190206" }, { "city": "梁溪", "code": "101190207" }, {
    "city": "新吴",
    "code": "101190208"
}, { "city": "镇江", "code": "101190301" }, { "city": "丹阳", "code": "101190302" }, {
    "city": "扬中",
    "code": "101190303"
}, { "city": "句容", "code": "101190304" }, { "city": "丹徒", "code": "101190305" }, {
    "city": "京口",
    "code": "101190306"
}, { "city": "润州", "code": "101190307" }, { "city": "苏州", "code": "101190401" }, {
    "city": "常熟",
    "code": "101190402"
}, { "city": "张家港", "code": "101190403" }, { "city": "昆山", "code": "101190404" }, {
    "city": "吴中",
    "code": "101190405"
}, { "city": "虎丘", "code": "101190406" }, { "city": "吴江", "code": "101190407" }, {
    "city": "太仓",
    "code": "101190408"
}, { "city": "相城", "code": "101190409" }, { "city": "姑苏", "code": "101190410" }, {
    "city": "南通",
    "code": "101190501"
}, { "city": "海安", "code": "101190502" }, { "city": "如皋", "code": "101190503" }, {
    "city": "如东",
    "code": "101190504"
}, { "city": "崇川", "code": "101190505" }, { "city": "港闸", "code": "101190506" }, {
    "city": "启东",
    "code": "101190507"
}, { "city": "海门", "code": "101190508" }, { "city": "通州", "code": "101190509" }, {
    "city": "扬州",
    "code": "101190601"
}, { "city": "宝应", "code": "101190602" }, { "city": "仪征", "code": "101190603" }, {
    "city": "高邮",
    "code": "101190604"
}, { "city": "江都", "code": "101190605" }, { "city": "邗江", "code": "101190606" }, {
    "city": "广陵",
    "code": "101190607"
}, { "city": "盐城", "code": "101190701" }, { "city": "响水", "code": "101190702" }, {
    "city": "滨海",
    "code": "101190703"
}, { "city": "阜宁", "code": "101190704" }, { "city": "射阳", "code": "101190705" }, {
    "city": "建湖",
    "code": "101190706"
}, { "city": "东台", "code": "101190707" }, { "city": "大丰", "code": "101190708" }, {
    "city": "盐都",
    "code": "101190709"
}, { "city": "亭湖", "code": "101190710" }, { "city": "徐州", "code": "101190801" }, {
    "city": "铜山",
    "code": "101190802"
}, { "city": "丰县", "code": "101190803" }, { "city": "沛县", "code": "101190804" }, {
    "city": "邳州",
    "code": "101190805"
}, { "city": "睢宁", "code": "101190806" }, { "city": "新沂", "code": "101190807" }, {
    "city": "鼓楼",
    "code": "101190808"
}, { "city": "云龙", "code": "101190809" }, { "city": "贾汪", "code": "101190810" }, {
    "city": "泉山",
    "code": "101190811"
}, { "city": "淮安", "code": "101190901" }, { "city": "金湖", "code": "101190902" }, {
    "city": "盱眙",
    "code": "101190903"
}, { "city": "洪泽", "code": "101190904" }, { "city": "涟水", "code": "101190905" }, {
    "city": "淮阴区",
    "code": "101190906"
}, { "city": "清江浦", "code": "101190907" }, { "city": "淮安区", "code": "101190908" }, {
    "city": "连云港",
    "code": "101191001"
}, { "city": "东海", "code": "101191002" }, { "city": "赣榆", "code": "101191003" }, {
    "city": "灌云",
    "code": "101191004"
}, { "city": "灌南", "code": "101191005" }, { "city": "海州", "code": "101191006" }, {
    "city": "连云",
    "code": "101191007"
}, { "city": "常州", "code": "101191101" }, { "city": "溧阳", "code": "101191102" }, {
    "city": "金坛",
    "code": "101191103"
}, { "city": "武进", "code": "101191104" }, { "city": "天宁", "code": "101191105" }, {
    "city": "钟楼",
    "code": "101191106"
}, { "city": "新北", "code": "101191107" }, { "city": "泰州", "code": "101191201" }, {
    "city": "兴化",
    "code": "101191202"
}, { "city": "泰兴", "code": "101191203" }, { "city": "姜堰", "code": "101191204" }, {
    "city": "靖江",
    "code": "101191205"
}, { "city": "海陵", "code": "101191206" }, { "city": "高港", "code": "101191207" }, {
    "city": "宿迁",
    "code": "101191301"
}, { "city": "沭阳", "code": "101191302" }, { "city": "泗阳", "code": "101191303" }, {
    "city": "泗洪",
    "code": "101191304"
}, { "city": "宿豫", "code": "101191305" }, { "city": "宿城", "code": "101191306" }, {
    "city": "武汉",
    "code": "101200101"
}, { "city": "蔡甸", "code": "101200102" }, { "city": "黄陂", "code": "101200103" }, {
    "city": "新洲",
    "code": "101200104"
}, { "city": "江夏", "code": "101200105" }, { "city": "东西湖", "code": "101200106" }, {
    "city": "江岸",
    "code": "101200107"
}, { "city": "江汉", "code": "101200108" }, { "city": "硚口", "code": "101200109" }, {
    "city": "汉阳",
    "code": "101200110"
}, { "city": "武昌", "code": "101200111" }, { "city": "青山", "code": "101200112" }, {
    "city": "洪山",
    "code": "101200113"
}, { "city": "汉南", "code": "101200114" }, { "city": "襄阳", "code": "101200201" }, {
    "city": "襄州",
    "code": "101200202"
}, { "city": "保康", "code": "101200203" }, { "city": "南漳", "code": "101200204" }, {
    "city": "宜城",
    "code": "101200205"
}, { "city": "老河口", "code": "101200206" }, { "city": "谷城", "code": "101200207" }, {
    "city": "枣阳",
    "code": "101200208"
}, { "city": "襄城", "code": "101200209" }, { "city": "樊城", "code": "101200210" }, {
    "city": "鄂州",
    "code": "101200301"
}, { "city": "梁子湖", "code": "101200302" }, { "city": "华容", "code": "101200303" }, {
    "city": "鄂城",
    "code": "101200304"
}, { "city": "孝感", "code": "101200401" }, { "city": "安陆", "code": "101200402" }, {
    "city": "云梦",
    "code": "101200403"
}, { "city": "大悟", "code": "101200404" }, { "city": "应城", "code": "101200405" }, {
    "city": "汉川",
    "code": "101200406"
}, { "city": "孝昌", "code": "101200407" }, { "city": "孝南", "code": "101200408" }, {
    "city": "黄冈",
    "code": "101200501"
}, { "city": "红安", "code": "101200502" }, { "city": "麻城", "code": "101200503" }, {
    "city": "罗田",
    "code": "101200504"
}, { "city": "英山", "code": "101200505" }, { "city": "浠水", "code": "101200506" }, {
    "city": "蕲春",
    "code": "101200507"
}, { "city": "黄梅", "code": "101200508" }, { "city": "武穴", "code": "101200509" }, {
    "city": "团风",
    "code": "101200510"
}, { "city": "黄州", "code": "101200511" }, { "city": "黄石", "code": "101200601" }, {
    "city": "大冶",
    "code": "101200602"
}, { "city": "阳新", "code": "101200603" }, { "city": "铁山", "code": "101200604" }, {
    "city": "下陆",
    "code": "101200605"
}, { "city": "西塞山", "code": "101200606" }, { "city": "黄石港", "code": "101200607" }, {
    "city": "咸宁",
    "code": "101200701"
}, { "city": "赤壁", "code": "101200702" }, { "city": "嘉鱼", "code": "101200703" }, {
    "city": "崇阳",
    "code": "101200704"
}, { "city": "通城", "code": "101200705" }, { "city": "通山", "code": "101200706" }, {
    "city": "咸安",
    "code": "101200707"
}, { "city": "荆州", "code": "101200801" }, { "city": "江陵", "code": "101200802" }, {
    "city": "公安",
    "code": "101200803"
}, { "city": "石首", "code": "101200804" }, { "city": "监利", "code": "101200805" }, {
    "city": "洪湖",
    "code": "101200806"
}, { "city": "松滋", "code": "101200807" }, { "city": "沙市", "code": "101200808" }, {
    "city": "宜昌",
    "code": "101200901"
}, { "city": "远安", "code": "101200902" }, { "city": "秭归", "code": "101200903" }, {
    "city": "兴山",
    "code": "101200904"
}, { "city": "西陵", "code": "101200905" }, { "city": "五峰", "code": "101200906" }, {
    "city": "当阳",
    "code": "101200907"
}, { "city": "长阳", "code": "101200908" }, { "city": "宜都", "code": "101200909" }, {
    "city": "枝江",
    "code": "101200910"
}, { "city": "三峡", "code": "101200911" }, { "city": "夷陵", "code": "101200912" }, {
    "city": "伍家岗",
    "code": "101200913"
}, { "city": "点军", "code": "101200914" }, { "city": "猇亭", "code": "101200915" }, {
    "city": "恩施",
    "code": "101201001"
}, { "city": "利川", "code": "101201002" }, { "city": "建始", "code": "101201003" }, {
    "city": "咸丰",
    "code": "101201004"
}, { "city": "宣恩", "code": "101201005" }, { "city": "鹤峰", "code": "101201006" }, {
    "city": "来凤",
    "code": "101201007"
}, { "city": "巴东", "code": "101201008" }, { "city": "十堰", "code": "101201101" }, {
    "city": "竹溪",
    "code": "101201102"
}, { "city": "郧西", "code": "101201103" }, { "city": "郧阳", "code": "101201104" }, {
    "city": "竹山",
    "code": "101201105"
}, { "city": "房县", "code": "101201106" }, { "city": "丹江口", "code": "101201107" }, {
    "city": "茅箭",
    "code": "101201108"
}, { "city": "张湾", "code": "101201109" }, { "city": "神农架", "code": "101201201" }, {
    "city": "随州",
    "code": "101201301"
}, { "city": "广水", "code": "101201302" }, { "city": "曾都", "code": "101201303" }, {
    "city": "随县",
    "code": "101201304"
}, { "city": "荆门", "code": "101201401" }, { "city": "钟祥", "code": "101201402" }, {
    "city": "京山",
    "code": "101201403"
}, { "city": "掇刀", "code": "101201404" }, { "city": "沙洋", "code": "101201405" }, {
    "city": "东宝",
    "code": "101201406"
}, { "city": "天门", "code": "101201501" }, { "city": "仙桃", "code": "101201601" }, {
    "city": "潜江",
    "code": "101201701"
}, { "city": "杭州", "code": "101210101" }, { "city": "萧山", "code": "101210102" }, {
    "city": "桐庐",
    "code": "101210103"
}, { "city": "淳安", "code": "101210104" }, { "city": "建德", "code": "101210105" }, {
    "city": "余杭",
    "code": "101210106"
}, { "city": "临安", "code": "101210107" }, { "city": "富阳", "code": "101210108" }, {
    "city": "上城",
    "code": "101210109"
}, { "city": "下城", "code": "101210110" }, { "city": "江干", "code": "101210111" }, {
    "city": "拱墅",
    "code": "101210112"
}, { "city": "西湖", "code": "101210113" }, { "city": "滨江", "code": "101210114" }, {
    "city": "湖州",
    "code": "101210201"
}, { "city": "长兴", "code": "101210202" }, { "city": "安吉", "code": "101210203" }, {
    "city": "德清",
    "code": "101210204"
}, { "city": "吴兴", "code": "101210205" }, { "city": "南浔", "code": "101210206" }, {
    "city": "嘉兴",
    "code": "101210301"
}, { "city": "嘉善", "code": "101210302" }, { "city": "海宁", "code": "101210303" }, {
    "city": "桐乡",
    "code": "101210304"
}, { "city": "平湖", "code": "101210305" }, { "city": "海盐", "code": "101210306" }, {
    "city": "南湖",
    "code": "101210307"
}, { "city": "秀洲", "code": "101210308" }, { "city": "宁波", "code": "101210401" }, {
    "city": "海曙",
    "code": "101210402"
}, { "city": "慈溪", "code": "101210403" }, { "city": "余姚", "code": "101210404" }, {
    "city": "奉化",
    "code": "101210405"
}, { "city": "象山", "code": "101210406" }, { "city": "宁海", "code": "101210408" }, {
    "city": "江北",
    "code": "101210409"
}, { "city": "北仑", "code": "101210410" }, { "city": "鄞州", "code": "101210411" }, {
    "city": "镇海",
    "code": "101210412"
}, { "city": "越城", "code": "101210501" }, { "city": "诸暨", "code": "101210502" }, {
    "city": "上虞",
    "code": "101210503"
}, { "city": "新昌", "code": "101210504" }, { "city": "嵊州", "code": "101210505" }, {
    "city": "柯桥",
    "code": "101210506"
}, { "city": "绍兴", "code": "101210507" }, { "city": "台州", "code": "101210601" }, {
    "city": "玉环",
    "code": "101210603"
}, { "city": "三门", "code": "101210604" }, { "city": "天台", "code": "101210605" }, {
    "city": "仙居",
    "code": "101210606"
}, { "city": "温岭", "code": "101210607" }, { "city": "临海", "code": "101210610" }, {
    "city": "椒江",
    "code": "101210611"
}, { "city": "黄岩", "code": "101210612" }, { "city": "路桥", "code": "101210613" }, {
    "city": "温州",
    "code": "101210701"
}, { "city": "泰顺", "code": "101210702" }, { "city": "文成", "code": "101210703" }, {
    "city": "平阳",
    "code": "101210704"
}, { "city": "瑞安", "code": "101210705" }, { "city": "洞头", "code": "101210706" }, {
    "city": "乐清",
    "code": "101210707"
}, { "city": "永嘉", "code": "101210708" }, { "city": "苍南", "code": "101210709" }, {
    "city": "鹿城",
    "code": "101210710"
}, { "city": "龙湾", "code": "101210711" }, { "city": "瓯海", "code": "101210712" }, {
    "city": "丽水",
    "code": "101210801"
}, { "city": "遂昌", "code": "101210802" }, { "city": "龙泉", "code": "101210803" }, {
    "city": "缙云",
    "code": "101210804"
}, { "city": "青田", "code": "101210805" }, { "city": "云和", "code": "101210806" }, {
    "city": "庆元",
    "code": "101210807"
}, { "city": "松阳", "code": "101210808" }, { "city": "景宁", "code": "101210809" }, {
    "city": "莲都",
    "code": "101210810"
}, { "city": "金华", "code": "101210901" }, { "city": "浦江", "code": "101210902" }, {
    "city": "兰溪",
    "code": "101210903"
}, { "city": "义乌", "code": "101210904" }, { "city": "东阳", "code": "101210905" }, {
    "city": "武义",
    "code": "101210906"
}, { "city": "永康", "code": "101210907" }, { "city": "磐安", "code": "101210908" }, {
    "city": "婺城",
    "code": "101210909"
}, { "city": "金东", "code": "101210910" }, { "city": "衢州", "code": "101211001" }, {
    "city": "常山",
    "code": "101211002"
}, { "city": "开化", "code": "101211003" }, { "city": "龙游", "code": "101211004" }, {
    "city": "江山",
    "code": "101211005"
}, { "city": "衢江", "code": "101211006" }, { "city": "柯城", "code": "101211007" }, {
    "city": "舟山",
    "code": "101211101"
}, { "city": "嵊泗", "code": "101211102" }, { "city": "岱山", "code": "101211104" }, {
    "city": "普陀",
    "code": "101211105"
}, { "city": "定海", "code": "101211106" }, { "city": "合肥", "code": "101220101" }, {
    "city": "长丰",
    "code": "101220102"
}, { "city": "肥东", "code": "101220103" }, { "city": "肥西", "code": "101220104" }, {
    "city": "巢湖",
    "code": "101220105"
}, { "city": "庐江", "code": "101220106" }, { "city": "瑶海", "code": "101220107" }, {
    "city": "庐阳",
    "code": "101220108"
}, { "city": "蜀山", "code": "101220109" }, { "city": "包河", "code": "101220110" }, {
    "city": "蚌埠",
    "code": "101220201"
}, { "city": "怀远", "code": "101220202" }, { "city": "固镇", "code": "101220203" }, {
    "city": "五河",
    "code": "101220204"
}, { "city": "龙子湖", "code": "101220205" }, { "city": "蚌山", "code": "101220206" }, {
    "city": "禹会",
    "code": "101220207"
}, { "city": "淮上", "code": "101220208" }, { "city": "芜湖", "code": "101220301" }, {
    "city": "繁昌",
    "code": "101220302"
}, { "city": "芜湖县", "code": "101220303" }, { "city": "南陵", "code": "101220304" }, {
    "city": "无为",
    "code": "101220305"
}, { "city": "镜湖", "code": "101220306" }, { "city": "弋江", "code": "101220307" }, {
    "city": "鸠江",
    "code": "101220308"
}, { "city": "三山", "code": "101220309" }, { "city": "淮南", "code": "101220401" }, {
    "city": "凤台",
    "code": "101220402"
}, { "city": "潘集", "code": "101220403" }, { "city": "大通", "code": "101220404" }, {
    "city": "田家庵",
    "code": "101220405"
}, { "city": "谢家集", "code": "101220406" }, { "city": "八公山", "code": "101220407" }, {
    "city": "寿县",
    "code": "101220408"
}, { "city": "马鞍山", "code": "101220501" }, { "city": "当涂", "code": "101220502" }, {
    "city": "含山",
    "code": "101220503"
}, { "city": "和县", "code": "101220504" }, { "city": "花山", "code": "101220505" }, {
    "city": "雨山",
    "code": "101220506"
}, { "city": "博望", "code": "101220507" }, { "city": "安庆", "code": "101220601" }, {
    "city": "太湖",
    "code": "101220603"
}, { "city": "潜山", "code": "101220604" }, { "city": "怀宁", "code": "101220605" }, {
    "city": "宿松",
    "code": "101220606"
}, { "city": "望江", "code": "101220607" }, { "city": "岳西", "code": "101220608" }, {
    "city": "桐城",
    "code": "101220609"
}, { "city": "迎江", "code": "101220610" }, { "city": "大观", "code": "101220611" }, {
    "city": "宜秀",
    "code": "101220612"
}, { "city": "宿州", "code": "101220701" }, { "city": "砀山", "code": "101220702" }, {
    "city": "灵璧",
    "code": "101220703"
}, { "city": "泗县", "code": "101220704" }, { "city": "萧县", "code": "101220705" }, {
    "city": "埇桥",
    "code": "101220706"
}, { "city": "阜阳", "code": "101220801" }, { "city": "阜南", "code": "101220802" }, {
    "city": "颍上",
    "code": "101220803"
}, { "city": "临泉", "code": "101220804" }, { "city": "界首", "code": "101220805" }, {
    "city": "太和",
    "code": "101220806"
}, { "city": "颍州", "code": "101220807" }, { "city": "颍东", "code": "101220808" }, {
    "city": "颍泉",
    "code": "101220809"
}, { "city": "亳州", "code": "101220901" }, { "city": "涡阳", "code": "101220902" }, {
    "city": "利辛",
    "code": "101220903"
}, { "city": "蒙城", "code": "101220904" }, { "city": "谯城", "code": "101220905" }, {
    "city": "黄山",
    "code": "101221001"
}, { "city": "黄山区", "code": "101221002" }, { "city": "屯溪", "code": "101221003" }, {
    "city": "祁门",
    "code": "101221004"
}, { "city": "黟县", "code": "101221005" }, { "city": "歙县", "code": "101221006" }, {
    "city": "休宁",
    "code": "101221007"
}, { "city": "黄山风景区(光明顶)", "code": "101221008" }, { "city": "徽州", "code": "101221009" }, {
    "city": "滁州",
    "code": "101221101"
}, { "city": "凤阳", "code": "101221102" }, { "city": "明光", "code": "101221103" }, {
    "city": "定远",
    "code": "101221104"
}, { "city": "全椒", "code": "101221105" }, { "city": "来安", "code": "101221106" }, {
    "city": "天长",
    "code": "101221107"
}, { "city": "琅琊", "code": "101221108" }, { "city": "南谯", "code": "101221109" }, {
    "city": "淮北",
    "code": "101221201"
}, { "city": "濉溪", "code": "101221202" }, { "city": "杜集", "code": "101221203" }, {
    "city": "相山",
    "code": "101221204"
}, { "city": "烈山", "code": "101221205" }, { "city": "铜陵", "code": "101221301" }, {
    "city": "铜官",
    "code": "101221302"
}, { "city": "义安", "code": "101221303" }, { "city": "郊区", "code": "101221304" }, {
    "city": "枞阳",
    "code": "101221305"
}, { "city": "宣城", "code": "101221401" }, { "city": "泾县", "code": "101221402" }, {
    "city": "旌德",
    "code": "101221403"
}, { "city": "宁国", "code": "101221404" }, { "city": "绩溪", "code": "101221405" }, {
    "city": "广德",
    "code": "101221406"
}, { "city": "郎溪", "code": "101221407" }, { "city": "宣州", "code": "101221408" }, {
    "city": "六安",
    "code": "101221501"
}, { "city": "霍邱", "code": "101221502" }, { "city": "金安", "code": "101221504" }, {
    "city": "金寨",
    "code": "101221505"
}, { "city": "霍山", "code": "101221506" }, { "city": "舒城", "code": "101221507" }, {
    "city": "裕安",
    "code": "101221508"
}, { "city": "叶集", "code": "101221509" }, { "city": "池州", "code": "101221701" }, {
    "city": "东至",
    "code": "101221702"
}, { "city": "青阳", "code": "101221703" }, { "city": "九华山", "code": "101221704" }, {
    "city": "石台",
    "code": "101221705"
}, { "city": "贵池", "code": "101221706" }, { "city": "福州", "code": "101230101" }, {
    "city": "闽清",
    "code": "101230102"
}, { "city": "闽侯", "code": "101230103" }, { "city": "罗源", "code": "101230104" }, {
    "city": "连江",
    "code": "101230105"
}, { "city": "鼓楼", "code": "101230106" }, { "city": "永泰", "code": "101230107" }, {
    "city": "平潭",
    "code": "101230108"
}, { "city": "台江", "code": "101230109" }, { "city": "长乐", "code": "101230110" }, {
    "city": "福清",
    "code": "101230111"
}, { "city": "仓山", "code": "101230112" }, { "city": "马尾", "code": "101230113" }, {
    "city": "晋安",
    "code": "101230114"
}, { "city": "厦门", "code": "101230201" }, { "city": "同安", "code": "101230202" }, {
    "city": "思明",
    "code": "101230203"
}, { "city": "海沧", "code": "101230204" }, { "city": "湖里", "code": "101230205" }, {
    "city": "集美",
    "code": "101230206"
}, { "city": "翔安", "code": "101230207" }, { "city": "宁德", "code": "101230301" }, {
    "city": "古田",
    "code": "101230302"
}, { "city": "霞浦", "code": "101230303" }, { "city": "寿宁", "code": "101230304" }, {
    "city": "周宁",
    "code": "101230305"
}, { "city": "福安", "code": "101230306" }, { "city": "柘荣", "code": "101230307" }, {
    "city": "福鼎",
    "code": "101230308"
}, { "city": "屏南", "code": "101230309" }, { "city": "蕉城", "code": "101230310" }, {
    "city": "莆田",
    "code": "101230401"
}, { "city": "仙游", "code": "101230402" }, { "city": "涵江", "code": "101230404" }, {
    "city": "秀屿",
    "code": "101230405"
}, { "city": "荔城", "code": "101230406" }, { "city": "城厢", "code": "101230407" }, {
    "city": "泉州",
    "code": "101230501"
}, { "city": "安溪", "code": "101230502" }, { "city": "金门", "code": "101230503" }, {
    "city": "永春",
    "code": "101230504"
}, { "city": "德化", "code": "101230505" }, { "city": "南安", "code": "101230506" }, {
    "city": "崇武",
    "code": "101230507"
}, { "city": "惠安", "code": "101230508" }, { "city": "晋江", "code": "101230509" }, {
    "city": "石狮",
    "code": "101230510"
}, { "city": "鲤城", "code": "101230511" }, { "city": "丰泽", "code": "101230512" }, {
    "city": "洛江",
    "code": "101230513"
}, { "city": "泉港", "code": "101230514" }, { "city": "漳州", "code": "101230601" }, {
    "city": "长泰",
    "code": "101230602"
}, { "city": "南靖", "code": "101230603" }, { "city": "平和", "code": "101230604" }, {
    "city": "龙海",
    "code": "101230605"
}, { "city": "漳浦", "code": "101230606" }, { "city": "诏安", "code": "101230607" }, {
    "city": "东山",
    "code": "101230608"
}, { "city": "云霄", "code": "101230609" }, { "city": "华安", "code": "101230610" }, {
    "city": "芗城",
    "code": "101230611"
}, { "city": "龙文", "code": "101230612" }, { "city": "龙岩", "code": "101230701" }, {
    "city": "长汀",
    "code": "101230702"
}, { "city": "连城", "code": "101230703" }, { "city": "武平", "code": "101230704" }, {
    "city": "上杭",
    "code": "101230705"
}, { "city": "永定", "code": "101230706" }, { "city": "漳平", "code": "101230707" }, {
    "city": "新罗",
    "code": "101230708"
}, { "city": "三明", "code": "101230801" }, { "city": "宁化", "code": "101230802" }, {
    "city": "清流",
    "code": "101230803"
}, { "city": "泰宁", "code": "101230804" }, { "city": "将乐", "code": "101230805" }, {
    "city": "建宁",
    "code": "101230806"
}, { "city": "明溪", "code": "101230807" }, { "city": "沙县", "code": "101230808" }, {
    "city": "尤溪",
    "code": "101230809"
}, { "city": "永安", "code": "101230810" }, { "city": "大田", "code": "101230811" }, {
    "city": "梅列",
    "code": "101230812"
}, { "city": "三元", "code": "101230813" }, { "city": "南平", "code": "101230901" }, {
    "city": "顺昌",
    "code": "101230902"
}, { "city": "光泽", "code": "101230903" }, { "city": "邵武", "code": "101230904" }, {
    "city": "武夷山",
    "code": "101230905"
}, { "city": "浦城", "code": "101230906" }, { "city": "建阳", "code": "101230907" }, {
    "city": "松溪",
    "code": "101230908"
}, { "city": "政和", "code": "101230909" }, { "city": "建瓯", "code": "101230910" }, {
    "city": "延平",
    "code": "101230911"
}, { "city": "钓鱼岛", "code": "101231001" }, { "city": "南昌", "code": "101240101" }, {
    "city": "新建",
    "code": "101240102"
}, { "city": "南昌县", "code": "101240103" }, { "city": "安义", "code": "101240104" }, {
    "city": "进贤",
    "code": "101240105"
}, { "city": "东湖", "code": "101240106" }, { "city": "西湖", "code": "101240107" }, {
    "city": "青云谱",
    "code": "101240108"
}, { "city": "湾里", "code": "101240109" }, { "city": "青山湖", "code": "101240110" }, {
    "city": "九江",
    "code": "101240201"
}, { "city": "瑞昌", "code": "101240202" }, { "city": "庐山", "code": "101240203" }, {
    "city": "武宁",
    "code": "101240204"
}, { "city": "德安", "code": "101240205" }, { "city": "永修", "code": "101240206" }, {
    "city": "湖口",
    "code": "101240207"
}, { "city": "彭泽", "code": "101240208" }, { "city": "都昌", "code": "101240210" }, {
    "city": "浔阳",
    "code": "101240211"
}, { "city": "修水", "code": "101240212" }, { "city": "共青城", "code": "101240213" }, {
    "city": "濂溪",
    "code": "101240214"
}, { "city": "柴桑", "code": "101240215" }, { "city": "上饶", "code": "101240301" }, {
    "city": "鄱阳",
    "code": "101240302"
}, { "city": "婺源", "code": "101240303" }, { "city": "信州", "code": "101240304" }, {
    "city": "余干",
    "code": "101240305"
}, { "city": "万年", "code": "101240306" }, { "city": "德兴", "code": "101240307" }, {
    "city": "上饶县",
    "code": "101240308"
}, { "city": "弋阳", "code": "101240309" }, { "city": "横峰", "code": "101240310" }, {
    "city": "铅山",
    "code": "101240311"
}, { "city": "玉山", "code": "101240312" }, { "city": "广丰", "code": "101240313" }, {
    "city": "抚州",
    "code": "101240401"
}, { "city": "广昌", "code": "101240402" }, { "city": "乐安", "code": "101240403" }, {
    "city": "崇仁",
    "code": "101240404"
}, { "city": "金溪", "code": "101240405" }, { "city": "资溪", "code": "101240406" }, {
    "city": "宜黄",
    "code": "101240407"
}, { "city": "南城", "code": "101240408" }, { "city": "南丰", "code": "101240409" }, {
    "city": "黎川",
    "code": "101240410"
}, { "city": "东乡", "code": "101240411" }, { "city": "临川", "code": "101240412" }, {
    "city": "宜春",
    "code": "101240501"
}, { "city": "铜鼓", "code": "101240502" }, { "city": "宜丰", "code": "101240503" }, {
    "city": "万载",
    "code": "101240504"
}, { "city": "上高", "code": "101240505" }, { "city": "靖安", "code": "101240506" }, {
    "city": "奉新",
    "code": "101240507"
}, { "city": "高安", "code": "101240508" }, { "city": "樟树", "code": "101240509" }, {
    "city": "丰城",
    "code": "101240510"
}, { "city": "袁州", "code": "101240511" }, { "city": "吉安", "code": "101240601" }, {
    "city": "吉安县",
    "code": "101240602"
}, { "city": "吉水", "code": "101240603" }, { "city": "新干", "code": "101240604" }, {
    "city": "峡江",
    "code": "101240605"
}, { "city": "永丰", "code": "101240606" }, { "city": "永新", "code": "101240607" }, {
    "city": "井冈山",
    "code": "101240608"
}, { "city": "万安", "code": "101240609" }, { "city": "遂川", "code": "101240610" }, {
    "city": "泰和",
    "code": "101240611"
}, { "city": "安福", "code": "101240612" }, { "city": "吉州", "code": "101240614" }, {
    "city": "青原",
    "code": "101240615"
}, { "city": "厦坪", "code": "101240616" }, { "city": "赣州", "code": "101240701" }, {
    "city": "崇义",
    "code": "101240702"
}, { "city": "上犹", "code": "101240703" }, { "city": "南康", "code": "101240704" }, {
    "city": "大余",
    "code": "101240705"
}, { "city": "信丰", "code": "101240706" }, { "city": "宁都", "code": "101240707" }, {
    "city": "石城",
    "code": "101240708"
}, { "city": "瑞金", "code": "101240709" }, { "city": "于都", "code": "101240710" }, {
    "city": "会昌",
    "code": "101240711"
}, { "city": "安远", "code": "101240712" }, { "city": "全南", "code": "101240713" }, {
    "city": "龙南",
    "code": "101240714"
}, { "city": "定南", "code": "101240715" }, { "city": "寻乌", "code": "101240716" }, {
    "city": "兴国",
    "code": "101240717"
}, { "city": "赣县", "code": "101240718" }, { "city": "章贡", "code": "101240719" }, {
    "city": "景德镇",
    "code": "101240801"
}, { "city": "乐平", "code": "101240802" }, { "city": "浮梁", "code": "101240803" }, {
    "city": "昌江",
    "code": "101240804"
}, { "city": "珠山", "code": "101240805" }, { "city": "萍乡", "code": "101240901" }, {
    "city": "莲花",
    "code": "101240902"
}, { "city": "上栗", "code": "101240903" }, { "city": "安源", "code": "101240904" }, {
    "city": "芦溪",
    "code": "101240905"
}, { "city": "湘东", "code": "101240906" }, { "city": "新余", "code": "101241001" }, {
    "city": "分宜",
    "code": "101241002"
}, { "city": "渝水", "code": "101241003" }, { "city": "鹰潭", "code": "101241101" }, {
    "city": "余江",
    "code": "101241102"
}, { "city": "贵溪", "code": "101241103" }, { "city": "月湖", "code": "101241104" }, {
    "city": "长沙",
    "code": "101250101"
}, { "city": "宁乡", "code": "101250102" }, { "city": "浏阳", "code": "101250103" }, {
    "city": "湘江新区",
    "code": "101250104"
}, { "city": "望城", "code": "101250105" }, { "city": "长沙县", "code": "101250106" }, {
    "city": "芙蓉",
    "code": "101250107"
}, { "city": "天心", "code": "101250108" }, { "city": "岳麓", "code": "101250109" }, {
    "city": "开福",
    "code": "101250110"
}, { "city": "雨花", "code": "101250111" }, { "city": "湘潭", "code": "101250201" }, {
    "city": "韶山",
    "code": "101250202"
}, { "city": "湘乡", "code": "101250203" }, { "city": "雨湖", "code": "101250204" }, {
    "city": "岳塘",
    "code": "101250205"
}, { "city": "株洲", "code": "101250301" }, { "city": "攸县", "code": "101250302" }, {
    "city": "醴陵",
    "code": "101250303"
}, { "city": "荷塘", "code": "101250304" }, { "city": "茶陵", "code": "101250305" }, {
    "city": "炎陵",
    "code": "101250306"
}, { "city": "芦淞", "code": "101250307" }, { "city": "石峰", "code": "101250308" }, {
    "city": "天元",
    "code": "101250309"
}, { "city": "衡阳", "code": "101250401" }, { "city": "衡山", "code": "101250402" }, {
    "city": "衡东",
    "code": "101250403"
}, { "city": "祁东", "code": "101250404" }, { "city": "衡阳县", "code": "101250405" }, {
    "city": "常宁",
    "code": "101250406"
}, { "city": "衡南", "code": "101250407" }, { "city": "耒阳", "code": "101250408" }, {
    "city": "南岳",
    "code": "101250409"
}, { "city": "珠晖", "code": "101250410" }, { "city": "雁峰", "code": "101250411" }, {
    "city": "石鼓",
    "code": "101250412"
}, { "city": "蒸湘", "code": "101250413" }, { "city": "郴州", "code": "101250501" }, {
    "city": "桂阳",
    "code": "101250502"
}, { "city": "嘉禾", "code": "101250503" }, { "city": "宜章", "code": "101250504" }, {
    "city": "临武",
    "code": "101250505"
}, { "city": "北湖", "code": "101250506" }, { "city": "资兴", "code": "101250507" }, {
    "city": "汝城",
    "code": "101250508"
}, { "city": "安仁", "code": "101250509" }, { "city": "永兴", "code": "101250510" }, {
    "city": "桂东",
    "code": "101250511"
}, { "city": "苏仙", "code": "101250512" }, { "city": "常德", "code": "101250601" }, {
    "city": "安乡",
    "code": "101250602"
}, { "city": "桃源", "code": "101250603" }, { "city": "汉寿", "code": "101250604" }, {
    "city": "澧县",
    "code": "101250605"
}, { "city": "临澧", "code": "101250606" }, { "city": "石门", "code": "101250607" }, {
    "city": "津市",
    "code": "101250608"
}, { "city": "武陵", "code": "101250609" }, { "city": "鼎城", "code": "101250610" }, {
    "city": "益阳",
    "code": "101250700"
}, { "city": "赫山区", "code": "101250701" }, { "city": "南县", "code": "101250702" }, {
    "city": "桃江",
    "code": "101250703"
}, { "city": "安化", "code": "101250704" }, { "city": "沅江", "code": "101250705" }, {
    "city": "资阳",
    "code": "101250706"
}, { "city": "娄底", "code": "101250801" }, { "city": "双峰", "code": "101250802" }, {
    "city": "冷水江",
    "code": "101250803"
}, { "city": "娄星", "code": "101250804" }, { "city": "新化", "code": "101250805" }, {
    "city": "涟源",
    "code": "101250806"
}, { "city": "邵阳", "code": "101250901" }, { "city": "隆回", "code": "101250902" }, {
    "city": "洞口",
    "code": "101250903"
}, { "city": "新邵", "code": "101250904" }, { "city": "邵东", "code": "101250905" }, {
    "city": "绥宁",
    "code": "101250906"
}, { "city": "新宁", "code": "101250907" }, { "city": "武冈", "code": "101250908" }, {
    "city": "城步",
    "code": "101250909"
}, { "city": "邵阳县", "code": "101250910" }, { "city": "双清", "code": "101250911" }, {
    "city": "大祥",
    "code": "101250912"
}, { "city": "北塔", "code": "101250913" }, { "city": "岳阳", "code": "101251001" }, {
    "city": "华容",
    "code": "101251002"
}, { "city": "湘阴", "code": "101251003" }, { "city": "汨罗", "code": "101251004" }, {
    "city": "平江",
    "code": "101251005"
}, { "city": "临湘", "code": "101251006" }, { "city": "岳阳楼区", "code": "101251007" }, {
    "city": "云溪",
    "code": "101251008"
}, { "city": "君山", "code": "101251009" }, { "city": "张家界", "code": "101251101" }, {
    "city": "桑植",
    "code": "101251102"
}, { "city": "慈利", "code": "101251103" }, { "city": "武陵源", "code": "101251104" }, {
    "city": "永定",
    "code": "101251105"
}, { "city": "怀化", "code": "101251201" }, { "city": "鹤城", "code": "101251202" }, {
    "city": "沅陵",
    "code": "101251203"
}, { "city": "辰溪", "code": "101251204" }, { "city": "靖州", "code": "101251205" }, {
    "city": "会同",
    "code": "101251206"
}, { "city": "通道", "code": "101251207" }, { "city": "麻阳", "code": "101251208" }, {
    "city": "新晃",
    "code": "101251209"
}, { "city": "芷江", "code": "101251210" }, { "city": "溆浦", "code": "101251211" }, {
    "city": "中方",
    "code": "101251212"
}, { "city": "洪江", "code": "101251213" }, { "city": "永州", "code": "101251401" }, {
    "city": "祁阳",
    "code": "101251402"
}, { "city": "东安", "code": "101251403" }, { "city": "双牌", "code": "101251404" }, {
    "city": "道县",
    "code": "101251405"
}, { "city": "宁远", "code": "101251406" }, { "city": "江永", "code": "101251407" }, {
    "city": "蓝山",
    "code": "101251408"
}, { "city": "新田", "code": "101251409" }, { "city": "江华", "code": "101251410" }, {
    "city": "冷水滩",
    "code": "101251411"
}, { "city": "零陵", "code": "101251412" }, { "city": "吉首", "code": "101251501" }, {
    "city": "保靖",
    "code": "101251502"
}, { "city": "永顺", "code": "101251503" }, { "city": "古丈", "code": "101251504" }, {
    "city": "凤凰",
    "code": "101251505"
}, { "city": "泸溪", "code": "101251506" }, { "city": "龙山", "code": "101251507" }, {
    "city": "花垣",
    "code": "101251508"
}, { "city": "湘西", "code": "101251509" }, { "city": "贵阳", "code": "101260101" }, {
    "city": "白云",
    "code": "101260102"
}, { "city": "花溪", "code": "101260103" }, { "city": "乌当", "code": "101260104" }, {
    "city": "息烽",
    "code": "101260105"
}, { "city": "开阳", "code": "101260106" }, { "city": "修文", "code": "101260107" }, {
    "city": "清镇",
    "code": "101260108"
}, { "city": "云岩", "code": "101260110" }, { "city": "南明", "code": "101260111" }, {
    "city": "观山湖",
    "code": "101260112"
}, { "city": "遵义", "code": "101260201" }, { "city": "仁怀", "code": "101260203" }, {
    "city": "绥阳",
    "code": "101260204"
}, { "city": "湄潭", "code": "101260205" }, { "city": "凤冈", "code": "101260206" }, {
    "city": "桐梓",
    "code": "101260207"
}, { "city": "赤水", "code": "101260208" }, { "city": "习水", "code": "101260209" }, {
    "city": "道真",
    "code": "101260210"
}, { "city": "正安", "code": "101260211" }, { "city": "务川", "code": "101260212" }, {
    "city": "余庆",
    "code": "101260213"
}, { "city": "汇川", "code": "101260214" }, { "city": "红花岗", "code": "101260215" }, {
    "city": "播州",
    "code": "101260216"
}, { "city": "安顺", "code": "101260301" }, { "city": "普定", "code": "101260302" }, {
    "city": "镇宁",
    "code": "101260303"
}, { "city": "平坝", "code": "101260304" }, { "city": "紫云", "code": "101260305" }, {
    "city": "关岭",
    "code": "101260306"
}, { "city": "西秀", "code": "101260307" }, { "city": "都匀", "code": "101260401" }, {
    "city": "贵定",
    "code": "101260402"
}, { "city": "瓮安", "code": "101260403" }, { "city": "长顺", "code": "101260404" }, {
    "city": "福泉",
    "code": "101260405"
}, { "city": "惠水", "code": "101260406" }, { "city": "龙里", "code": "101260407" }, {
    "city": "罗甸",
    "code": "101260408"
}, { "city": "平塘", "code": "101260409" }, { "city": "独山", "code": "101260410" }, {
    "city": "三都",
    "code": "101260411"
}, { "city": "荔波", "code": "101260412" }, { "city": "黔南", "code": "101260413" }, {
    "city": "凯里",
    "code": "101260501"
}, { "city": "岑巩", "code": "101260502" }, { "city": "施秉", "code": "101260503" }, {
    "city": "镇远",
    "code": "101260504"
}, { "city": "黄平", "code": "101260505" }, { "city": "黔东南", "code": "101260506" }, {
    "city": "麻江",
    "code": "101260507"
}, { "city": "丹寨", "code": "101260508" }, { "city": "三穗", "code": "101260509" }, {
    "city": "台江",
    "code": "101260510"
}, { "city": "剑河", "code": "101260511" }, { "city": "雷山", "code": "101260512" }, {
    "city": "黎平",
    "code": "101260513"
}, { "city": "天柱", "code": "101260514" }, { "city": "锦屏", "code": "101260515" }, {
    "city": "榕江",
    "code": "101260516"
}, { "city": "从江", "code": "101260517" }, { "city": "铜仁", "code": "101260601" }, {
    "city": "江口",
    "code": "101260602"
}, { "city": "玉屏", "code": "101260603" }, { "city": "万山", "code": "101260604" }, {
    "city": "思南",
    "code": "101260605"
}, { "city": "碧江", "code": "101260606" }, { "city": "印江", "code": "101260607" }, {
    "city": "石阡",
    "code": "101260608"
}, { "city": "沿河", "code": "101260609" }, { "city": "德江", "code": "101260610" }, {
    "city": "松桃",
    "code": "101260611"
}, { "city": "毕节", "code": "101260701" }, { "city": "赫章", "code": "101260702" }, {
    "city": "金沙",
    "code": "101260703"
}, { "city": "威宁", "code": "101260704" }, { "city": "大方", "code": "101260705" }, {
    "city": "纳雍",
    "code": "101260706"
}, { "city": "织金", "code": "101260707" }, { "city": "黔西", "code": "101260708" }, {
    "city": "七星关",
    "code": "101260709"
}, { "city": "水城", "code": "101260801" }, { "city": "六枝", "code": "101260802" }, {
    "city": "六盘水",
    "code": "101260803"
}, { "city": "盘州", "code": "101260804" }, { "city": "钟山", "code": "101260805" }, {
    "city": "兴义",
    "code": "101260901"
}, { "city": "晴隆", "code": "101260902" }, { "city": "兴仁", "code": "101260903" }, {
    "city": "贞丰",
    "code": "101260904"
}, { "city": "望谟", "code": "101260905" }, { "city": "黔西南", "code": "101260906" }, {
    "city": "安龙",
    "code": "101260907"
}, { "city": "册亨", "code": "101260908" }, { "city": "普安", "code": "101260909" }, {
    "city": "成都",
    "code": "101270101"
}, { "city": "龙泉驿", "code": "101270102" }, { "city": "新都", "code": "101270103" }, {
    "city": "温江",
    "code": "101270104"
}, { "city": "金堂", "code": "101270105" }, { "city": "双流", "code": "101270106" }, {
    "city": "郫都",
    "code": "101270107"
}, { "city": "大邑", "code": "101270108" }, { "city": "蒲江", "code": "101270109" }, {
    "city": "新津",
    "code": "101270110"
}, { "city": "都江堰", "code": "101270111" }, { "city": "彭州", "code": "101270112" }, {
    "city": "邛崃",
    "code": "101270113"
}, { "city": "崇州", "code": "101270114" }, { "city": "青白江", "code": "101270115" }, {
    "city": "锦江",
    "code": "101270116"
}, { "city": "青羊", "code": "101270117" }, { "city": "金牛", "code": "101270118" }, {
    "city": "武侯",
    "code": "101270119"
}, { "city": "成华", "code": "101270120" }, { "city": "简阳", "code": "101270121" }, {
    "city": "攀枝花",
    "code": "101270201"
}, { "city": "仁和", "code": "101270202" }, { "city": "米易", "code": "101270203" }, {
    "city": "盐边",
    "code": "101270204"
}, { "city": "东区", "code": "101270205" }, { "city": "西区", "code": "101270206" }, {
    "city": "自贡",
    "code": "101270301"
}, { "city": "富顺", "code": "101270302" }, { "city": "荣县", "code": "101270303" }, {
    "city": "自流井",
    "code": "101270304"
}, { "city": "贡井", "code": "101270305" }, { "city": "大安", "code": "101270306" }, {
    "city": "沿滩",
    "code": "101270307"
}, { "city": "绵阳", "code": "101270401" }, { "city": "三台", "code": "101270402" }, {
    "city": "盐亭",
    "code": "101270403"
}, { "city": "梓潼", "code": "101270405" }, { "city": "北川", "code": "101270406" }, {
    "city": "平武",
    "code": "101270407"
}, { "city": "江油", "code": "101270408" }, { "city": "涪城", "code": "101270409" }, {
    "city": "游仙",
    "code": "101270410"
}, { "city": "安州", "code": "101270411" }, { "city": "南充", "code": "101270501" }, {
    "city": "南部",
    "code": "101270502"
}, { "city": "营山", "code": "101270503" }, { "city": "蓬安", "code": "101270504" }, {
    "city": "仪陇",
    "code": "101270505"
}, { "city": "西充", "code": "101270506" }, { "city": "阆中", "code": "101270507" }, {
    "city": "顺庆",
    "code": "101270508"
}, { "city": "高坪", "code": "101270509" }, { "city": "嘉陵", "code": "101270510" }, {
    "city": "达州",
    "code": "101270601"
}, { "city": "宣汉", "code": "101270602" }, { "city": "开江", "code": "101270603" }, {
    "city": "大竹",
    "code": "101270604"
}, { "city": "渠县", "code": "101270605" }, { "city": "万源", "code": "101270606" }, {
    "city": "通川",
    "code": "101270607"
}, { "city": "达川", "code": "101270608" }, { "city": "遂宁", "code": "101270701" }, {
    "city": "蓬溪",
    "code": "101270702"
}, { "city": "射洪", "code": "101270703" }, { "city": "船山", "code": "101270704" }, {
    "city": "安居",
    "code": "101270705"
}, { "city": "大英", "code": "101270706" }, { "city": "广安", "code": "101270801" }, {
    "city": "岳池",
    "code": "101270802"
}, { "city": "武胜", "code": "101270803" }, { "city": "邻水", "code": "101270804" }, {
    "city": "华蓥",
    "code": "101270805"
}, { "city": "前锋", "code": "101270806" }, { "city": "巴中", "code": "101270901" }, {
    "city": "通江",
    "code": "101270902"
}, { "city": "南江", "code": "101270903" }, { "city": "平昌", "code": "101270904" }, {
    "city": "巴州",
    "code": "101270905"
}, { "city": "恩阳", "code": "101270906" }, { "city": "泸州", "code": "101271001" }, {
    "city": "江阳",
    "code": "101271002"
}, { "city": "泸县", "code": "101271003" }, { "city": "合江", "code": "101271004" }, {
    "city": "叙永",
    "code": "101271005"
}, { "city": "古蔺", "code": "101271006" }, { "city": "纳溪", "code": "101271007" }, {
    "city": "龙马潭",
    "code": "101271008"
}, { "city": "宜宾", "code": "101271101" }, { "city": "翠屏", "code": "101271102" }, {
    "city": "宜宾县",
    "code": "101271103"
}, { "city": "南溪", "code": "101271104" }, { "city": "江安", "code": "101271105" }, {
    "city": "长宁",
    "code": "101271106"
}, { "city": "高县", "code": "101271107" }, { "city": "珙县", "code": "101271108" }, {
    "city": "筠连",
    "code": "101271109"
}, { "city": "兴文", "code": "101271110" }, { "city": "屏山", "code": "101271111" }, {
    "city": "内江",
    "code": "101271201"
}, { "city": "东兴", "code": "101271202" }, { "city": "威远", "code": "101271203" }, {
    "city": "资中",
    "code": "101271204"
}, { "city": "隆昌", "code": "101271205" }, { "city": "市中", "code": "101271206" }, {
    "city": "资阳",
    "code": "101271301"
}, { "city": "安岳", "code": "101271302" }, { "city": "乐至", "code": "101271303" }, {
    "city": "雁江",
    "code": "101271305"
}, { "city": "乐山", "code": "101271401" }, { "city": "犍为", "code": "101271402" }, {
    "city": "井研",
    "code": "101271403"
}, { "city": "夹江", "code": "101271404" }, { "city": "沐川", "code": "101271405" }, {
    "city": "峨边",
    "code": "101271406"
}, { "city": "马边", "code": "101271407" }, { "city": "峨眉山", "code": "101271409" }, {
    "city": "市中",
    "code": "101271410"
}, { "city": "沙湾", "code": "101271411" }, { "city": "五通桥", "code": "101271412" }, {
    "city": "金口河",
    "code": "101271413"
}, { "city": "峨眉山市", "code": "101271414" }, { "city": "眉山", "code": "101271501" }, {
    "city": "仁寿",
    "code": "101271502"
}, { "city": "彭山", "code": "101271503" }, { "city": "洪雅", "code": "101271504" }, {
    "city": "丹棱",
    "code": "101271505"
}, { "city": "青神", "code": "101271506" }, { "city": "东坡", "code": "101271507" }, {
    "city": "凉山",
    "code": "101271601"
}, { "city": "木里", "code": "101271603" }, { "city": "盐源", "code": "101271604" }, {
    "city": "德昌",
    "code": "101271605"
}, { "city": "会理", "code": "101271606" }, { "city": "会东", "code": "101271607" }, {
    "city": "宁南",
    "code": "101271608"
}, { "city": "普格", "code": "101271609" }, { "city": "西昌", "code": "101271610" }, {
    "city": "金阳",
    "code": "101271611"
}, { "city": "昭觉", "code": "101271612" }, { "city": "喜德", "code": "101271613" }, {
    "city": "冕宁",
    "code": "101271614"
}, { "city": "越西", "code": "101271615" }, { "city": "甘洛", "code": "101271616" }, {
    "city": "雷波",
    "code": "101271617"
}, { "city": "美姑", "code": "101271618" }, { "city": "布拖", "code": "101271619" }, {
    "city": "雅安",
    "code": "101271701"
}, { "city": "名山", "code": "101271702" }, { "city": "荥经", "code": "101271703" }, {
    "city": "汉源",
    "code": "101271704"
}, { "city": "石棉", "code": "101271705" }, { "city": "天全", "code": "101271706" }, {
    "city": "芦山",
    "code": "101271707"
}, { "city": "宝兴", "code": "101271708" }, { "city": "雨城", "code": "101271709" }, {
    "city": "甘孜",
    "code": "101271801"
}, { "city": "康定", "code": "101271802" }, { "city": "泸定", "code": "101271803" }, {
    "city": "丹巴",
    "code": "101271804"
}, { "city": "九龙", "code": "101271805" }, { "city": "雅江", "code": "101271806" }, {
    "city": "道孚",
    "code": "101271807"
}, { "city": "炉霍", "code": "101271808" }, { "city": "新龙", "code": "101271809" }, {
    "city": "德格",
    "code": "101271810"
}, { "city": "白玉", "code": "101271811" }, { "city": "石渠", "code": "101271812" }, {
    "city": "色达",
    "code": "101271813"
}, { "city": "理塘", "code": "101271814" }, { "city": "巴塘", "code": "101271815" }, {
    "city": "乡城",
    "code": "101271816"
}, { "city": "稻城", "code": "101271817" }, { "city": "得荣", "code": "101271818" }, {
    "city": "阿坝",
    "code": "101271901"
}, { "city": "汶川", "code": "101271902" }, { "city": "理县", "code": "101271903" }, {
    "city": "茂县",
    "code": "101271904"
}, { "city": "松潘", "code": "101271905" }, { "city": "九寨沟", "code": "101271906" }, {
    "city": "金川",
    "code": "101271907"
}, { "city": "小金", "code": "101271908" }, { "city": "黑水", "code": "101271909" }, {
    "city": "马尔康",
    "code": "101271910"
}, { "city": "壤塘", "code": "101271911" }, { "city": "若尔盖", "code": "101271912" }, {
    "city": "红原",
    "code": "101271913"
}, { "city": "德阳", "code": "101272001" }, { "city": "中江", "code": "101272002" }, {
    "city": "广汉",
    "code": "101272003"
}, { "city": "什邡", "code": "101272004" }, { "city": "绵竹", "code": "101272005" }, {
    "city": "罗江",
    "code": "101272006"
}, { "city": "旌阳", "code": "101272007" }, { "city": "广元", "code": "101272101" }, {
    "city": "旺苍",
    "code": "101272102"
}, { "city": "青川", "code": "101272103" }, { "city": "剑阁", "code": "101272104" }, {
    "city": "苍溪",
    "code": "101272105"
}, { "city": "利州", "code": "101272106" }, { "city": "昭化", "code": "101272107" }, {
    "city": "朝天",
    "code": "101272108"
}, { "city": "广州", "code": "101280101" }, { "city": "番禺", "code": "101280102" }, {
    "city": "从化",
    "code": "101280103"
}, { "city": "增城", "code": "101280104" }, { "city": "花都", "code": "101280105" }, {
    "city": "荔湾",
    "code": "101280106"
}, { "city": "越秀", "code": "101280107" }, { "city": "海珠", "code": "101280108" }, {
    "city": "天河",
    "code": "101280109"
}, { "city": "白云", "code": "101280110" }, { "city": "黄埔", "code": "101280111" }, {
    "city": "南沙",
    "code": "101280112"
}, { "city": "韶关", "code": "101280201" }, { "city": "乳源", "code": "101280202" }, {
    "city": "始兴",
    "code": "101280203"
}, { "city": "翁源", "code": "101280204" }, { "city": "乐昌", "code": "101280205" }, {
    "city": "仁化",
    "code": "101280206"
}, { "city": "南雄", "code": "101280207" }, { "city": "新丰", "code": "101280208" }, {
    "city": "曲江",
    "code": "101280209"
}, { "city": "浈江", "code": "101280210" }, { "city": "武江", "code": "101280211" }, {
    "city": "惠州",
    "code": "101280301"
}, { "city": "博罗", "code": "101280302" }, { "city": "惠阳", "code": "101280303" }, {
    "city": "惠东",
    "code": "101280304"
}, { "city": "龙门", "code": "101280305" }, { "city": "惠城", "code": "101280306" }, {
    "city": "梅州",
    "code": "101280401"
}, { "city": "兴宁", "code": "101280402" }, { "city": "蕉岭", "code": "101280403" }, {
    "city": "大埔",
    "code": "101280404"
}, { "city": "梅江", "code": "101280405" }, { "city": "丰顺", "code": "101280406" }, {
    "city": "平远",
    "code": "101280407"
}, { "city": "五华", "code": "101280408" }, { "city": "梅县", "code": "101280409" }, {
    "city": "汕头",
    "code": "101280501"
}, { "city": "潮阳", "code": "101280502" }, { "city": "澄海", "code": "101280503" }, {
    "city": "南澳",
    "code": "101280504"
}, { "city": "龙湖", "code": "101280505" }, { "city": "金平", "code": "101280506" }, {
    "city": "濠江",
    "code": "101280507"
}, { "city": "潮南", "code": "101280508" }, { "city": "深圳", "code": "101280601" }, {
    "city": "罗湖",
    "code": "101280602"
}, { "city": "福田", "code": "101280603" }, { "city": "南山", "code": "101280604" }, {
    "city": "宝安",
    "code": "101280605"
}, { "city": "龙岗", "code": "101280606" }, { "city": "盐田", "code": "101280607" }, {
    "city": "龙华",
    "code": "101280608"
}, { "city": "坪山", "code": "101280609" }, { "city": "珠海", "code": "101280701" }, {
    "city": "斗门",
    "code": "101280702"
}, { "city": "金湾", "code": "101280703" }, { "city": "香洲", "code": "101280704" }, {
    "city": "佛山",
    "code": "101280800"
}, { "city": "顺德", "code": "101280801" }, { "city": "三水", "code": "101280802" }, {
    "city": "南海",
    "code": "101280803"
}, { "city": "高明", "code": "101280804" }, { "city": "禅城", "code": "101280805" }, {
    "city": "肇庆",
    "code": "101280901"
}, { "city": "广宁", "code": "101280902" }, { "city": "四会", "code": "101280903" }, {
    "city": "端州",
    "code": "101280904"
}, { "city": "德庆", "code": "101280905" }, { "city": "怀集", "code": "101280906" }, {
    "city": "封开",
    "code": "101280907"
}, { "city": "高要", "code": "101280908" }, { "city": "鼎湖", "code": "101280909" }, {
    "city": "湛江",
    "code": "101281001"
}, { "city": "吴川", "code": "101281002" }, { "city": "雷州", "code": "101281003" }, {
    "city": "徐闻",
    "code": "101281004"
}, { "city": "廉江", "code": "101281005" }, { "city": "赤坎", "code": "101281006" }, {
    "city": "遂溪",
    "code": "101281007"
}, { "city": "坡头", "code": "101281008" }, { "city": "霞山", "code": "101281009" }, {
    "city": "麻章",
    "code": "101281010"
}, { "city": "江门", "code": "101281101" }, { "city": "开平", "code": "101281103" }, {
    "city": "新会",
    "code": "101281104"
}, { "city": "恩平", "code": "101281105" }, { "city": "台山", "code": "101281106" }, {
    "city": "蓬江",
    "code": "101281107"
}, { "city": "鹤山", "code": "101281108" }, { "city": "江海", "code": "101281109" }, {
    "city": "河源",
    "code": "101281201"
}, { "city": "紫金", "code": "101281202" }, { "city": "连平", "code": "101281203" }, {
    "city": "和平",
    "code": "101281204"
}, { "city": "龙川", "code": "101281205" }, { "city": "东源", "code": "101281206" }, {
    "city": "源城",
    "code": "101281207"
}, { "city": "清远", "code": "101281301" }, { "city": "连南", "code": "101281302" }, {
    "city": "连州",
    "code": "101281303"
}, { "city": "连山", "code": "101281304" }, { "city": "阳山", "code": "101281305" }, {
    "city": "佛冈",
    "code": "101281306"
}, { "city": "英德", "code": "101281307" }, { "city": "清新", "code": "101281308" }, {
    "city": "清城",
    "code": "101281309"
}, { "city": "云浮", "code": "101281401" }, { "city": "罗定", "code": "101281402" }, {
    "city": "新兴",
    "code": "101281403"
}, { "city": "郁南", "code": "101281404" }, { "city": "云城", "code": "101281405" }, {
    "city": "云安",
    "code": "101281406"
}, { "city": "潮州", "code": "101281501" }, { "city": "饶平", "code": "101281502" }, {
    "city": "潮安",
    "code": "101281503"
}, { "city": "湘桥", "code": "101281504" }, { "city": "东莞", "code": "101281601" }, {
    "city": "中山",
    "code": "101281701"
}, { "city": "阳江", "code": "101281801" }, { "city": "阳春", "code": "101281802" }, {
    "city": "阳东",
    "code": "101281803"
}, { "city": "阳西", "code": "101281804" }, { "city": "江城", "code": "101281805" }, {
    "city": "揭阳",
    "code": "101281901"
}, { "city": "揭西", "code": "101281902" }, { "city": "普宁", "code": "101281903" }, {
    "city": "惠来",
    "code": "101281904"
}, { "city": "揭东", "code": "101281905" }, { "city": "榕城", "code": "101281906" }, {
    "city": "茂名",
    "code": "101282001"
}, { "city": "高州", "code": "101282002" }, { "city": "化州", "code": "101282003" }, {
    "city": "电白",
    "code": "101282004"
}, { "city": "陇川", "code": "101291503" }, { "city": "盈江", "code": "101291504" }, {
    "city": "瑞丽",
    "code": "101291506"
}, { "city": "梁河", "code": "101291507" }, { "city": "芒市", "code": "101291508" }, {
    "city": "景洪",
    "code": "101291601"
}, { "city": "西双版纳", "code": "101291602" }, { "city": "勐海", "code": "101291603" }, {
    "city": "勐腊",
    "code": "101291605"
}, { "city": "南宁", "code": "101300101" }, { "city": "兴宁", "code": "101300102" }, {
    "city": "邕宁",
    "code": "101300103"
}, { "city": "横县", "code": "101300104" }, { "city": "隆安", "code": "101300105" }, {
    "city": "马山",
    "code": "101300106"
}, { "city": "上林", "code": "101300107" }, { "city": "武鸣", "code": "101300108" }, {
    "city": "宾阳",
    "code": "101300109"
}, { "city": "青秀", "code": "101300110" }, { "city": "江南", "code": "101300111" }, {
    "city": "西乡塘",
    "code": "101300112"
}, { "city": "良庆", "code": "101300113" }, { "city": "崇左", "code": "101300201" }, {
    "city": "天等",
    "code": "101300202"
}, { "city": "龙州", "code": "101300203" }, { "city": "凭祥", "code": "101300204" }, {
    "city": "大新",
    "code": "101300205"
}, { "city": "扶绥", "code": "101300206" }, { "city": "宁明", "code": "101300207" }, {
    "city": "江州",
    "code": "101300208"
}, { "city": "柳州", "code": "101300301" }, { "city": "柳城", "code": "101300302" }, {
    "city": "城中",
    "code": "101300303"
}, { "city": "鹿寨", "code": "101300304" }, { "city": "柳江", "code": "101300305" }, {
    "city": "融安",
    "code": "101300306"
}, { "city": "融水", "code": "101300307" }, { "city": "三江", "code": "101300308" }, {
    "city": "鱼峰",
    "code": "101300309"
}, { "city": "柳南", "code": "101300310" }, { "city": "柳北", "code": "101300311" }, {
    "city": "来宾",
    "code": "101300401"
}, { "city": "忻城", "code": "101300402" }, { "city": "金秀", "code": "101300403" }, {
    "city": "象州",
    "code": "101300404"
}, { "city": "武宣", "code": "101300405" }, { "city": "合山", "code": "101300406" }, {
    "city": "兴宾",
    "code": "101300407"
}, { "city": "桂林", "code": "101300501" }, { "city": "秀峰", "code": "101300502" }, {
    "city": "龙胜",
    "code": "101300503"
}, { "city": "永福", "code": "101300504" }, { "city": "临桂", "code": "101300505" }, {
    "city": "兴安",
    "code": "101300506"
}, { "city": "灵川", "code": "101300507" }, { "city": "全州", "code": "101300508" }, {
    "city": "灌阳",
    "code": "101300509"
}, { "city": "阳朔", "code": "101300510" }, { "city": "恭城", "code": "101300511" }, {
    "city": "平乐",
    "code": "101300512"
}, { "city": "荔浦", "code": "101300513" }, { "city": "资源", "code": "101300514" }, {
    "city": "叠彩",
    "code": "101300515"
}, { "city": "象山", "code": "101300516" }, { "city": "七星", "code": "101300517" }, {
    "city": "雁山",
    "code": "101300518"
}, { "city": "梧州", "code": "101300601" }, { "city": "藤县", "code": "101300602" }, {
    "city": "万秀",
    "code": "101300603"
}, { "city": "苍梧", "code": "101300604" }, { "city": "蒙山", "code": "101300605" }, {
    "city": "岑溪",
    "code": "101300606"
}, { "city": "长洲", "code": "101300607" }, { "city": "龙圩", "code": "101300608" }, {
    "city": "贺州",
    "code": "101300701"
}, { "city": "昭平", "code": "101300702" }, { "city": "富川", "code": "101300703" }, {
    "city": "钟山",
    "code": "101300704"
}, { "city": "八步", "code": "101300705" }, { "city": "平桂", "code": "101300706" }, {
    "city": "贵港",
    "code": "101300801"
}, { "city": "桂平", "code": "101300802" }, { "city": "平南", "code": "101300803" }, {
    "city": "港北",
    "code": "101300804"
}, { "city": "港南", "code": "101300805" }, { "city": "覃塘", "code": "101300806" }, {
    "city": "玉林",
    "code": "101300901"
}, { "city": "博白", "code": "101300902" }, { "city": "北流", "code": "101300903" }, {
    "city": "容县",
    "code": "101300904"
}, { "city": "陆川", "code": "101300905" }, { "city": "兴业", "code": "101300906" }, {
    "city": "玉州",
    "code": "101300907"
}, { "city": "福绵", "code": "101300908" }, { "city": "百色", "code": "101301001" }, {
    "city": "那坡",
    "code": "101301002"
}, { "city": "田阳", "code": "101301003" }, { "city": "德保", "code": "101301004" }, {
    "city": "靖西",
    "code": "101301005"
}, { "city": "田东", "code": "101301006" }, { "city": "平果", "code": "101301007" }, {
    "city": "隆林",
    "code": "101301008"
}, { "city": "西林", "code": "101301009" }, { "city": "乐业", "code": "101301010" }, {
    "city": "凌云",
    "code": "101301011"
}, { "city": "田林", "code": "101301012" }, { "city": "右江", "code": "101301013" }, {
    "city": "钦州",
    "code": "101301101"
}, { "city": "浦北", "code": "101301102" }, { "city": "灵山", "code": "101301103" }, {
    "city": "钦南",
    "code": "101301104"
}, { "city": "钦北", "code": "101301105" }, { "city": "河池", "code": "101301201" }, {
    "city": "天峨",
    "code": "101301202"
}, { "city": "东兰", "code": "101301203" }, { "city": "巴马", "code": "101301204" }, {
    "city": "环江",
    "code": "101301205"
}, { "city": "罗城", "code": "101301206" }, { "city": "宜州", "code": "101301207" }, {
    "city": "凤山",
    "code": "101301208"
}, { "city": "南丹", "code": "101301209" }, { "city": "都安", "code": "101301210" }, {
    "city": "大化",
    "code": "101301211"
}, { "city": "金城江", "code": "101301212" }, { "city": "北海", "code": "101301301" }, {
    "city": "合浦",
    "code": "101301302"
}, { "city": "涠洲岛", "code": "101301303" }, { "city": "海城", "code": "101301304" }, {
    "city": "银海",
    "code": "101301305"
}, { "city": "铁山港", "code": "101301306" }, { "city": "防城港", "code": "101301401" }, {
    "city": "上思",
    "code": "101301402"
}, { "city": "东兴", "code": "101301403" }, { "city": "港口", "code": "101301404" }, {
    "city": "防城",
    "code": "101301405"
}, { "city": "海口", "code": "101310101" }, { "city": "秀英", "code": "101310102" }, {
    "city": "龙华",
    "code": "101310103"
}, { "city": "琼山", "code": "101310104" }, { "city": "美兰", "code": "101310105" }, {
    "city": "三亚",
    "code": "101310201"
}, { "city": "海棠", "code": "101310213" }, { "city": "吉阳", "code": "101310218" }, {
    "city": "天涯",
    "code": "101310219"
}, { "city": "崖州", "code": "101310223" }, { "city": "东方", "code": "101310202" }, {
    "city": "临高",
    "code": "101310203"
}, { "city": "澄迈", "code": "101310204" }, { "city": "儋州", "code": "101310205" }, {
    "city": "昌江",
    "code": "101310206"
}, { "city": "白沙", "code": "101310207" }, { "city": "琼中", "code": "101310208" }, {
    "city": "定安",
    "code": "101310209"
}, { "city": "屯昌", "code": "101310210" }, { "city": "琼海", "code": "101310211" }, {
    "city": "文昌",
    "code": "101310212"
}, { "city": "保亭", "code": "101310214" }, { "city": "万宁", "code": "101310215" }, {
    "city": "陵水",
    "code": "101310216"
}, { "city": "乐东", "code": "101310221" }, { "city": "五指山", "code": "101310222" }, {
    "city": "三沙",
    "code": "101310301"
}, { "city": "西沙", "code": "101310302" }, { "city": "中沙", "code": "101310303" }, {
    "city": "南沙",
    "code": "101310304"
}, { "city": "黄岩岛", "code": "101310305" }, { "city": "香港", "code": "101320101" }, {
    "city": "九龙",
    "code": "101320102"
}, { "city": "新界", "code": "101320103" }, { "city": "澳门", "code": "101330101" }, {
    "city": "氹仔岛",
    "code": "101330102"
}, { "city": "路环岛", "code": "101330103" }, { "city": "台北", "code": "101340101" }, {
    "city": "桃园",
    "code": "101340102"
}, { "city": "新竹", "code": "101340103" }, { "city": "宜兰", "code": "101340104" }, {
    "city": "高雄",
    "code": "101340201"
}, { "city": "嘉义", "code": "101340202" }, { "city": "台南", "code": "101340203" }, {
    "city": "台东",
    "code": "101340204"
}, { "city": "屏东", "code": "101340205" }, { "city": "台中", "code": "101340401" }, {
    "city": "苗栗",
    "code": "101340402"
}, { "city": "彰化", "code": "101340403" }, { "city": "南投", "code": "101340404" }, {
    "city": "花莲",
    "code": "101340405"
}, { "city": "云林", "code": "101340406" }] as Code[]


export function getCode(city: string): string {
    for (const v of cityCode) {
        if (v.city == city) return v.code
    }
    return '0';
}

export function cityList(): string[] {
    const list = []
    for (const v of cityCode) {
        list.push(v.city)
    }
    return list
}

export function searchCode(name: string): Code[] {
    const list = [] as Code[];
    for (const v of cityCode) {
        if (v.city.includes(name) || name.includes(v.city)) {
            list.push(v)
        }
    }
    return list;
}